{"category":"Mental Health Issue 2017","category_link":"http://www.dailycal.org/section/special/mental-health-issue-2017/","headline":"Where We Cry","subhead":"The Daily Californian is collecting stories about students crying on campus.","dateline":"November 3, 2017","updated":"November 21, 2017","sections":[{"type":"text","text":"\nFor our special issue on mental health, The Daily Californian created an interactive map for readers to share their experiences of crying at UC Berkeley. So far, we have received more than 360 submissions.\n\nIf you’re comfortable, tell us about a time you cried and where it happened, be it a hidden corner in Dwinelle Hall or the middle of Memorial Glade. Also include why you were crying, whether you were happy or sad. Reviewed submissions will be added to the map.\n\nContent warning: Some of the stories below deal with themes of depression and suicide. For those seeking help, we have provided resources at the bottom of this page.\n\nBelow the map, we’ve highlighted the stories of five respondents."},{"type":"map"},{"type":"form"},{"type":"line"},{"type":"interview","image":"haley.jpg","header":"Haley Minish, junior","location":"Kroeber Fountain","quote":"“My father called me and told me my paw-paw passed away.”","text":"\nThe last time Haley Minish saw her grandfather, it was at a nursing home.\n\n“This one lady kept trying to hit on (him), asking him to dance,” she said. “It was cute.”\n\nHer grandfather had been in a nursing home suffering from memory loss. But Minish’s memories of him begin at his house in North Carolina.\n\n“My parents had me when they both were really young,” Minish said. “And (my grandfather) helped my dad turn his basement into a bedroom for my mom, my dad and me, so we had a home.”\n\nHe had lived in the same house for as long as she could remember. Even after her parents split up, whenever Minish visited her grandfather, she had her own room where she wrote her name on the walls.\n\nWhen Minish received the call about her grandfather’s death this Halloween, she found a place on a bench near Kroeber Fountain and cried. She stayed there, sharing memories of her “Papaw” with her father on the phone.\n\n“Anyone who knew (my grandfather) knew him in his red convertible or on his Harley Davidson,” Minish said. “And I just picture him doing that right now.”"},{"type":"interview","image":"jennifer.jpg","header":"Jennifer Huang, alumna","location":"Valley Life Sciences Building","quote":"“I was studying late in a library with some friends during my first semester of freshman year. My mom called me and I went outside to talk to her. Suddenly, I burst into tears from the overwhelming stress of midterms and the heavy weight on my chest of having to decide what I wanted to do with my life. I felt so directionless, like I was guessing at my interests and major and potentially guessing wrong. I finished up the conversation, cleaned up my face and went back to the library to study with my friends.”","text":"\nCourse selection season was “the worst,” Jennifer Huang said. For her, it was not just a matter of getting into the classes she wanted — but also choosing them.\n\n“I felt like I had this golden opportunity, a very limited window to choose classes, but … I was tossing rings into hoops blindly,” she said.\n\nWhen Huang came to Berkeley, she took classes in math and literature, science and art, trying to land on her passion. Many of her peers had chosen a field to pursue, and this added to the pressure Huang felt. \n\nThe night Huang called her mom, she wasn’t expecting to cry.\n\n“I distinctly remember that time because it was such a general anxiety,” Huang said. “It wasn't a specific thing. It wasn't like I failed a midterm. It was like, ‘what am I doing to do with my life?’ I was choosing all the wrong things, and it was this looming, very widespread fear.”\n\nHuang attributed those feelings to the pressure of the campus environment and the pressure she placed on herself. While she said the administration made students without a declared major feel welcome, Huang still felt stressed when the time came to select classes, afraid that she was wasting her time without a direct path to follow.\n\nDuring her time on campus, however, Huang saw “every single one of (her) friends” go through the same “existential crisis” she did during her freshman year. Many of those who were sure of their direction ending up switching to a completely different major, she said.\n\nAt the top of the steps in front of the Valley Life Sciences Building — the same place she cried five years ago — Huang talked about her current plans. After graduating in December 2016 with a degree in molecular and cellular biology and music, Huang has decided to pursue music professionally.\n\n“I am glad I found something I really love to do, but it took ... questioning to get there,” Huang said. “Write it out, listen to what you want, listen to what your mind is telling you and just embrace it.”"},{"type":"interview","image":"siobhan.jpg","header":"Siobhan Garry, sophomore","location":"LeConte Hall","quote":"“Spring 2017 semester I had just started seeing a psychiatrist and was trying out different dosages of antidepressants. The one I was trying was making my memory really bad, and one day I was going to leave a class early to go make up a quiz. I completely forgot (the quiz) and with five minutes left for me to get there, I was sprinting around LeConte trying to find the room while emailing my (graduate student instructor). He ended up just leaving before I found the room, and I sobbed really hard on one of the bridges connecting the buildings.”","text":"\nFor Siobhan Garry, one of the most difficult parts of dealing with depression was handling the side effects of their antidepressant medication, which included short-term memory loss.\n\n“I was kind of a mess, running around LeConte trying to find this room where (graduate student instructors) did their office hours,” Garry said. “I didn’t have (Disabled Students’ Program) accommodations at the time, so I was super hesitant about asking for stuff.”\n\nDespite these memory slips, Garry felt their experience with their psychiatrist was positive, and they found themselves noticeably more stable, they said.\n\n“I think that mental health issues are visible at Berkeley, but the resources aren’t, and the actual healing part isn’t,” Garry said.\n\nReferencing the “weird dichotomy” of students who silently deal with depression and those who joke about it, Garry said that it is sometimes hard to distinguish between people using humor to cope with depression and “people making the joke just to make the joke.”\n\nFor those silently dealing with depression, Garry advises to trust what they’re feeling. \n\n“I think it can be hard to have these emotions and (ask if they are) real,” Garry said. “Am I just a wimp, and ... not able to deal with this better, or is this an actual problem for me and my health?’”"},{"type":"interview","image":"sara.jpg","header":"Sara Gutierrez, senior","location":"Barrows Hall","quote":"“I performed a poem about my trauma for the Poetry for the People class. It was the first time in my life I spoke about an incredible act of violence that happened seven years ago, and I bore my soul to my small nine-person section. I will always be grateful for my peers and the (teaching assistants) for holding a space and helping me heal.”","text":"\nAs an astrophysics and geophysics major, Sara Gutierrez is used to “leaving her experience and story at the door” when she enters class, she said.\n\nBut when Gutierrez took Poetry for the People, a course offered by the campus African American Studies department, she found herself in a class that focused on students’ emotions and experiences for the first time. For one class assignment, students were asked to share a poem about a traumatizing experience with a small group of peers.\n\n“(My trauma) poem was the first time that I spoke about something that is unspeakable that happened to my family seven years ago,“ Gutierrez said. “It was really intense. It was really visceral ... I was bawling and almost screaming by the end of the poem.”\n\nIn her nine-person section, Gutierrez read something she had never before said out loud. Because of the “beautiful support” her peers provided throughout the semester, Gutierrez was able to take “a load of seven years … off (her) shoulder,” she said.\n\n“I think it is important to be gentle with yourself and know that what you are experiencing is very difficult,” Gutierrez said. “If someone is to never reflect deeply and work through things and speak openly with the community, it is like denying a part of your identity.”\n\nAs a former Golden Bear Orientation leader and residential advisor, Gutierrez tries to stress the importance of finding a community and being vulnerable with new students. She believes mental health across campus would be better if there were more classes such as Poetry for the People, “where you could open yourself up and be vulnerable,” she said.\n\nThis year, she is taking another class taught by the same professor.\n\n“I will always hold that experience with me, that art and community can heal you,” Gutierrez said."},{"type":"interview","image":"antony.jpg","header":"Anthony Beron, alumnus","location":"Greek Theatre","quote":"“Undergraduate graduation, happy (bittersweet) with my daughter next to me. For many reasons it was an exceedingly emotional day. Yep, cried in public at Berkeley when I almost made it through dry-eyed. It felt better looking around though, a lot of intense feelings graduates were experiencing. Go Bears!”","text":"\nEven when Anthony Beron was a “long-haired, skinny, scruffy” freshman in high school, he knew he wanted to go to UC Berkeley. Everyone in his small Catholic school in Delaware thought he was “crazy,” he said, and his parents agreed.\n\nBut when Beron reached campus, he quickly encountered financial and academic problems, he said. He felt easily distracted, and his grades suffered.\n\n“This was before computers,” Beron said. “We are talking typewriters and whiteout. And my papers looked like a lot of whiteout. It was not pretty.”\n\nIn 1984, Beron was put on academic probation and dismissed from UC Berkeley, he said, so he transferred to the University of San Francisco. But he never graduated because he “thought maybe (he) would come back to Berkeley.”\n\nAlmost ten years later, Beron was readmitted to UC Berkeley, and after taking gap years to work and raise his family, he graduated in 2014. By that time, he already had a family and a graduate degree — but now, he had closure.\n\n“It was a miracle I was able to graduate,” Beron said in an email. “One financial aid advisor who worked for decades at Berkeley told me she had never seen a student with a law degree go back to finish their (bachelor’s degree). I am sure the epic nature of my lengthy and unorthodox path had something to do with my catharsis at the Greek at commencement.”\n\n“You do it day to day and you don’t really think about it,” he said. “I knew going to Berkeley was going to be a challenge, so I cut off all the emotional wiring to be able to make it through.” \n\nIn the midst of processing his graduation, his girlfriend nudged him. The professor on stage was talking about Beron’s senior thesis. Hearing the professor talk about him caught him off-guard, and the tears started to flow.\n\n“If you are going to pick a school to cry, Berkeley is a good place to cry,” Beron said. “You are not going to get punched in the face. That's the thing that really dragged me to Berkeley ... it draws in … (a) whole range of emotions and characters.”"},{"type":"text","text":"\nFor those seeking help, UC Berkeley’s <a href=\"https://uhs.berkeley.edu/counseling\">Tang Center</a> offers counseling services and resources for mental health. \n\nThe <a href=\"https://www.crisistextline.org/\">Crisis Text Line</a> offers free, 24/7 emotional support for those in crisis via text messaging. To use the service, text HOME to 741741.\n\nThe City of Berkeley also has a <a href=\"https://www.cityofberkeley.info/Health_Human_Services/Mental_Health/Mobile_Crisis_Team_(MCT).aspx\">Mobile Crisis Team</a> that aims to reduce the impact of mental health emergencies. Its phone number is 510-981-5900."}]}
