{"category":"Mental Health Issue 2017","category_link":"http://www.dailycal.org/section/special/mental-health-issue-2017/","headline":"Where We Cry","subhead":"The Daily Californian is collecting stories about students crying on campus.","dateline":"November 3, 2017","updated":"November 17, 2017","sections":[{"type":"text","text":"\nFor our special issue on mental health, The Daily Californian created an interactive map for readers to share their experiences of crying at UC Berkeley. So far, we have received over 360 submissions; out of those submissions, we have followed up on a select few to reveal more about their story. Read more about those below the map.\n\nIf you’re comfortable, tell us about a time you cried and where it happened, be it a hidden corner in Dwinelle Hall or the middle of Memorial Glade. Also include why you were crying, whether you were happy or sad. Reviewed submissions will be added to the map.\n\nContent warning: Some of the stories below deal with themes of depression and suicide. For those seeking help, we have provided resources at the bottom of this page."},{"type":"map"},{"type":"form"},{"type":"interview_right","image":"haley.jpg","header":"Haley Minish, sophomore","location":"Kroeber Fountain","quote":"“My father called me and told me my paw-paw passed away.”","text":"\nThe last time Haley Minish saw her grandfather, it was at a nursing home. She remembers “this one lady kept trying to hit on my grandfather, asking him to dance.”\n\n“It was cute,” she added.\n\nHer grandfather had been in a nursing home for a while, suffering from memory loss. But Minish’s memories of him start in his house in North Carolina. \n\n“My parents had me when they both were really young,” Minish said. “And [my grandfather] helped my dad turn his basement into a bedroom for my mom, my dad and me, so we had a home.”\n\nHe lived in that same house for as long as she could remember. Even after her parents split up, whenever Minish came to visit her grandfather, she had her own room where she wrote her name on the walls. \n\nWhen Minish received the call about her grandfather’s death this Halloween, she found a place on a bench near Kroeber Fountain and cried. She stayed there for a while, sharing memories of her “Papaw” with her dad. \n\n“Anyone who knew [my grandfather] knew him in his red convertible or on his Harley Davidson,” Minish said. “And I just picture him doing that right now.”"},{"type":"interview_left","image":"jennifer.jpg","header":"Jennifer Huang, alumni","location":"Valley Life Sciences Building","quote":"“I was studying late in a library with some friends during my first semester of freshman year. My mom called me and I went outside to talk to her. Suddenly, I burst into tears from the overwhelming stress of midterms and the heavy weight on my chest of having to decide what I wanted to do with my life. I felt so directionless, like I was guessing at my interests and major and potentially guessing wrong. I finished up the conversation, cleaned up my face and went back to the library to study with my friends.”","text":"\nJennifer Huang didn’t expect to cry when her mother called her that night. \n\nAs an undeclared student entering Berkeley, Huang felt pressured to choose a major as soon as possible. While many of her peers had chosen fields to focus on, Huang felt pressed with time, in a “limited window” where she was “blindly choosing [classes].”\n\n“I distinctly remember that time because it was such a general anxiety,” Huang recalled. “It wasn't a specific thing. It wasn't like I failed a midterm. It was like, ‘what am I doing to do with my life?’ I was choosing all the wrong things, and it was this looming, very widespread fear that really affect[ed] me.\n\nHuang attributed these feelings both to the pressure of Berkeley’s environment and the pressure she placed on herself. While she felt that the administration did a good job in making undecided students feel welcome, with workshops and restrictions that kept students from declaring before their second year, Huang still felt stressed when the time came around to select classes, afraid that she was wasting her time with a variety of classes and no direct path to follow.\n\nGoing through college, however, Huang saw every single one of her friends go through the same “existential crisis” she did in freshman year, with many of those who were sure of their major ending up switching to a completely different major.\n\nAt the top of the steps in front of the Valley Life Sciences Building, the same steps she had cried at five years ago, Huang talks about her current plans. After graduating in Dec. 2016 with a degree in molecular and cellular biology and music, Huang decided to pursue music as a profession. \n\n“I am glad I found something I really love to do, but it took that kind of questioning to get there,” Huang reflected. “College is so young ... if it happens, it happens. Write it out, listen to what you want, listen to what your mind is telling you, and just embrace it.”"},{"type":"interview_right","image":"siobhan.jpg","header":"Siobhan Gary, sophomore","location":"LeConte Hall","quote":"","text":"\nDuring their second semester as a freshman, Siobhan Gary just started seeing a psychiatrist and taking antidepressants. While testing different dosages of the prescription, Gary started having short-term memory loss as a side effect, causing them to miss a physics quiz earlier in the week, and again for the rescheduled quiz.\n\n“I was kind of a mess, running around LeConte trying to find this room where [graduate student instructors] did their office hours,” Gary recalled, after forgetting to leave their class early to makeup the quiz. “I didn’t have [Disabled Students’ Program] accommodations at the time, so I was super hesitant about asking for stuff.”\n\nDespite short-term memory slips between prescription refills and the incident that occurred, Gary felt positive about their experience with their psychiatrist. They found themselves to be noticeably more stable and were glad they pursued the resource.\n\n“I think that mental health issues are visible at Berkeley, but the resources aren’t and the actual healing part of isn’t,” said Gary. Referencing the “weird dichotomy” of students who silently deal with depression and those who joke about it, Gary notes “it’s hard to distinguish when [people are using humor to cope with depression] or when people are making the joke just to make the joke … there’s no conversation about [what] dealing with [depression] looks like.”\n\nTo Gary, dealing with depression includes not being able to get medication, not having money to see a psychiatrist and dropping out of school, all which could happen when those suffering from depression are not supported at Berkeley. \n\nFor those who are silently dealing with depression, Gary advises to trust what they’re feeling. \n\n“I think it can be hard to have these emotions and [ask if] this is real, am I just a wimp, am I just not able to deal with this better, or is this an actual problem for me and my health,” said Gary. “I think [recovering from depression is to] trust yourself, let yourself ask for help and let yourself seek out for help.“"},{"type":"interview_left","image":"sara.jpg","header":"Sara Gutierrez, senior","location":"Barrows Hall","quote":"“I performed a poem about my trauma for the Poetry for the People class. It was the first time in my life I spoke about an incredible act of violence that happened seven years ago, and I bore my soul to my small nine person section. I will always be grateful for my peers and the [teaching assistants] for holding a space and helping me heal.”","text":"\nAs an astrophysics and geophysics major, senior Sara Gutierrez is used to leaving her experience and emotions at the door when she enters class. \n\nBut when Gutierrez took Poetry for the People, it was her first experience in a class that focused on the students’ emotions and experiences. For one of the assignments, students were asked to share a poem about a traumatizing experience to their small section.\n\n“[My trauma] poem was the first time that I spoke about something that is unspeakable that happened to my family seven ago,“ Gutierrez said. “It was really intense. It was really visceral ... I was balling and almost screaming by the end of the poem.”\n\nIn this small nine person section, Gutierrez was able to was read something that she had never said out loud. Because of the “beautiful space” and “beautiful support” her peers provided throughout the semester, Gutierrez was able to relieve “a load of seven years” off her shoulder. \n\n“I think it is important to be gentle with yourself and know that what you are experiencing is very difficult,” Gutierrez said. “If someone is to never reflect deeply and work through things and speak openly with the community, it is like denying a part of your identity.”\n\nAs a Golden Bear Orientation leader and residential advisor, Gutierrez tries to stress the importance of finding a community and being vulnerable with new students.  She believes mental health would be better across campus if there were more classes, like Poetry for the People, “where you could open yourself up and be vulnerable.” This year, she is taking another class by the same professor.\n\n“I will always hold that experience with me, that art and community can heal you,” Gutierrez said, reflecting on her experience of crying in front of her peers."},{"type":"interview_right","image":"antony.jpg","header":"Antony Beron, alumni","location":"Greek Theater","quote":"“Undergraduate graduation, happy (bittersweet) with my daughter next to me.  For many reasons it was an exceedingly emotional day.  Yep, cried in public at Berkeley when I almost made it through dry-eyed. It felt better looking around though, a lot of intense feelings graduates were experiencing.  Go Bears!!”","text":""},{"type":"text","text":"\nFor those seeking help, UC Berkeley’s <a href=\"https://uhs.berkeley.edu/counseling\">Tang Center</a> offers counseling services and resources for mental health. \n\nThe <a href=\"https://www.crisistextline.org/\">Crisis Text Line</a> offers free, 24/7 emotional support for those in crisis via text messaging. To use the service, text HOME to 741741.\n\nThe City of Berkeley also has a <a href=\"https://www.cityofberkeley.info/Health_Human_Services/Mental_Health/Mobile_Crisis_Team_(MCT).aspx\">Mobile Crisis Team</a> that aims to reduce the impact of mental health emergencies. Its phone number is 510-981-5900."}]}
