{"events":[{"lat":37.866805,"long":-122.257511,"message":"Stress and personal reasons"},{"lat":37.871206,"long":-122.259353,"message":"The last time was from being overwhelmed by school and life in general, the second being rejection from a creative writing class, and the first time being rejection from the first club I ever applied to at Cal at the beginning of my freshman year"},{"lat":37.873211,"long":-122.264308,"message":"CS61B Project 1 final office hours before the project was due had just ended and my project wasn't complete and I still needed help. "},{"lat":37.875146,"long":-122.25755,"message":"existential crisis about my future"},{"lat":37.867715,"long":-122.255647,"message":"Friend/Relationship Drama, Anxiety attack, stress"},{"lat":37.872684,"long":-122.261005,"message":"Realized I was going to fail my midterm and also had like 100 other stressful things on my mind"},{"lat":37.872743,"long":-122.260608,"message":"Stressed about midterms, general anxiety "},{"lat":37.867448,"long":-122.264243,"message":"During my freshman year, I was getting birth control for the first time and was seeing a physician about it. During my consultation I ended up fainting and had to sit in the waiting room with my prescription alone for like 15 minutes because the doctor had to move on to other patients. I went to the bathroom in Tang and cried for like 10 minutes once I got to leave but couldn't really tell anyone because I so embarrassed on various levels."},{"lat":37.866352,"long":-122.254402,"message":"Boy problems"},{"lat":37.872557,"long":-122.260597,"message":"Everything "},{"lat":37.867002,"long":-122.259901,"message":"Stress"},{"lat":37.869929,"long":-122.257661,"message":"Just got word that my father suddenly passed away"},{"lat":37.876555,"long":-122.26023,"message":"Work from chem 3b, clubs,  sleep deprivation,  math,  and missing roommate"},{"lat":37.87285,"long":-122.257029,"message":"My life is in shambles!"},{"lat":37.875394,"long":-122.260535,"message":"My daily catharsis"},{"lat":37.867417,"long":-122.260065,"message":"Stress"},{"lat":37.869607,"long":-122.258548,"message":"I had just come out of Asian American Studies R2A, which I was taking over summer. The class was the first time I had dealt with so many issues regarding my identity, specifically coming to terms with my non-heterosexualness. One day, discussion was open to reflecting upon our identities. It was the first time I had talked about my sexuality in such a serious manner, and I bawled my eyes out. The last time I had cried was 7 years ago, so one could imagine how overwhelming yet cathartic the experience was. Once class ended, my friend took care of me, and came with me to Sproul Plaza where I continued to cry for half an hour on that patch of grass."},{"lat":37.872213,"long":-122.257347,"message":"Freaking out about indirect criticism at work that made me feel insecure about my skills at my job."},{"lat":37.871312,"long":-122.256781,"message":"Failed my first midterm"},{"lat":37.874297,"long":-122.2666,"message":"i was sad because i was in a fight with a friend"},{"lat":37.874339,"long":-122.266605,"message":"I failed :("},{"lat":37.872371,"long":-122.260769,"message":"laughing too much!!"},{"lat":37.872328,"long":-122.259756,"message":"I have a mental health condition (GAD) and I cry a lot when I experience stressful confusion or deadlines that trigger my anxiety or give me a panic attack. "},{"lat":37.873954,"long":-122.259566,"message":"Because the maps library was closed :( I love maps"},{"lat":37.869006,"long":-122.254786,"message":"General sadness"},{"lat":37.867913,"long":-122.255356,"message":"Orientation was incredibly overwhelming"},{"lat":37.867989,"long":-122.254712,"message":"My boyfriend was leaving for college and that day was the last time I'd see him for months"},{"lat":37.874018,"long":-122.256298,"message":"I was only able to finish half of my midterm and everyone else finished early"},{"lat":37.870699,"long":-122.260611,"message":"The weight of the world and existential despair"},{"lat":37.875163,"long":-122.260484,"message":"I was in the office the day of the Las Vegas shooting, and had woken up to a breaking news story about the shooting. Someone mentioned that there were some shots fired at USC, where my friend attends. I was worried about her safety. Thankfully, it was a false alarm, the reports of shots fired at USC were false."},{"undefined":"LatLng(37.86743, -122.2647)","lat":37.86743,"long":-122.2647,"message":"After months of mounting anxiety during a very stressful school year, I got a horrible flu which basically triggered an ongoing panic attack. In the aftermath, I couldn't breathe in class one day, and I left and walked to Tang to seek help at the mental health clinic. While speaking with someone, I couldn't help but cry. It was so scary, and yet such a relief, to admit how much I'd been struggling. The help I got that day and after has been formative in my life since. "},{"undefined":"LatLng(37.87341, -122.26427)","lat":37.87341,"long":-122.26427,"message":"Grad life"},{"undefined":"LatLng(37.86852, -122.26041)","lat":37.86852,"long":-122.26041,"message":"I was studying in Moffit during my second year when my Dad called me from India to tell me that my grandfather passed. He asked me if I was OK, and I said I would just go home. I thought I would hold it in till I walked there but I happened to run into the two first friends that I made at Cal on the way home. One of them hugged me to greet me, and I burst into tears and stayed in that hug for a long time."},{"undefined":"LatLng(37.87084, -122.25859)","lat":37.87084,"long":-122.25859,"message":"I've cried on the bench across from Wheeler overlooking Strawberry Creek at least 6 times since last spring. The last time it was because all of my friends have graduated and I constantly feel alone; before that, it was from anxiety about all of my deadlines and imposter syndrome; & before that, it was because I had just come from a class where one of my classmates was stalking me and sending me aggressive messages and the department had told me the day before that they couldn't do anything about it."},{"undefined":"LatLng(37.86981, -122.25899)","lat":37.86981,"long":-122.25899,"message":"I was stressed out about life: upcoming midterms, missing home, and just wanting some sleep. I found a lonely staircase and cried until I felt better. "},{"undefined":"LatLng(37.86964, -122.26805)","lat":37.86964,"long":-122.26805,"message":"I cried because Berkeley is no longer the #1 public university"},{"undefined":"LatLng(37.86948, -122.25663)","lat":37.86948,"long":-122.25663,"message":"I was really overwhelmed with academics and personal things. I tried to keep my struggles hidden and told nobody about what was going on. Eventually, all that stress just got to me and I had a major mental/emotional breakdown."},{"undefined":"LatLng(37.87157, -122.25178)","lat":37.87157,"long":-122.25178,"message":"I felt like I was losing a friend. A really close friend. "},{"undefined":"LatLng(37.87385, -122.2596)","lat":37.87385,"long":-122.2596,"message":"stress and relationship"},{"undefined":"LatLng(37.86963, -122.25192)","lat":37.86963,"long":-122.25192,"message":"Overwhelmed by work, a romantic relationship, family pressure, academic success, and an existential crisis. "},{"undefined":"LatLng(37.87257, -122.26072)","lat":37.87257,"long":-122.26072,"message":"fighting with significant other"},{"undefined":"LatLng(37.8705, -122.26031)","lat":37.8705,"long":-122.26031,"message":"had a devastating midterm"},{"undefined":"LatLng(37.87128, -122.26357)","lat":37.87128,"long":-122.26357,"message":"As an undergrad in a lab, I gave a lab meeting  presentation I thought was solid.  It was torn apart, just really, ripped to pieces. Academic achievement had been such a core part of my personality until then, that I didn't know how to process being wrong without taking it personally."},{"undefined":"LatLng(37.87147, -122.26037)","lat":37.87147,"long":-122.26037,"message":"all nighters in Moffitt!!!"},{"undefined":"LatLng(37.86782, -122.25896)","lat":37.86782,"long":-122.25896,"message":"Felt so rejected, low, stressed and hungry"},{"undefined":"LatLng(37.8696, -122.25549)","lat":37.8696,"long":-122.25549,"message":"I was upset with my roommate and needed to go outside and have a good cry at how crappy my day had been"},{"undefined":"LatLng(37.87089, -122.25071)","lat":37.87089,"long":-122.25071,"message":"we lost again"},{"undefined":"LatLng(37.87285, -122.2626)","lat":37.87285,"long":-122.2626,"message":"I usually get stress out about classes and work. Maybe it's hormonal or not but I go to the bathroom and cry. "},{"undefined":"LatLng(37.86857, -122.27174)","lat":37.86857,"long":-122.27174,"message":"I taught a lesson in front of my supervisor and didn't feel that great about it and my supervisor was giving me all these suggestions but it felt like I had all these deficits and I started thinking about my decision to become a teacher."},{"undefined":"LatLng(37.87235, -122.26035)","lat":37.87235,"long":-122.26035,"message":"I cried because transferring is hard, and I wasn't able to meet the standards set by myself and others."},{"undefined":"LatLng(37.87119, -122.26014)","lat":37.87119,"long":-122.26014,"message":"I had finally gotten into the last course I needed to declare, but I hated the way the professor was teaching the material. I didn't know if I was making the right decision to declare, but it was also too late in my academic career to declare anything else. I cried in front of my academic counselor even when I knew that she didn't give a damn about who I was as an individual."},{"undefined":"LatLng(37.87488, -122.25936)","lat":37.87488,"long":-122.25936,"message":"I got a D in a class in my second to last semester and cried to my advisor about my fears of not graduating and how stupid I felt for getting a D."},{"undefined":"LatLng(37.86618, -122.25877)","lat":37.86618,"long":-122.25877,"message":"Intermezzo was still around. I was enjoying my favorite salad when I got the phone call that my grandmother had finally been relieved of her suffering from breast cancer. I stood at the intersection, facing all the oncoming Telegraph traffic, and let it go."},{"undefined":"LatLng(37.8692, -122.25776)","lat":37.8692,"long":-122.25776,"message":"I had a physics midterm and I couldn't do a single question.  I held in my cries during the actual exam, but cried in my floormate's arms after."},{"undefined":"LatLng(37.86904, -122.25968)","lat":37.86904,"long":-122.25968,"message":"I ve begun the coming out process and have been feeling very vulnerable and anxious lately. I visited the Marsha P. Johnson lounge in MLK for the first time and felt a sense of comfort that I hadn t experienced in a while."},{"undefined":"LatLng(37.87241, -122.25801)","lat":37.87241,"long":-122.25801,"message":"i watched the 1-800 video and cried like a baby in Stanley Hall"},{"undefined":"LatLng(37.86762, -122.2588)","lat":37.86762,"long":-122.2588,"message":"i was a freshman in the midst of apartment hunting and things just kept not working out and everyone around me had found a place to stay already. it seemed impossible with the housing crisis on top of my limited financial means, so one night i just broke down in fear that i would be homeless next year."},{"undefined":"LatLng(37.87335, -122.25826)","lat":37.87335,"long":-122.25826,"message":"I cry all the time, mostly due to frustration but also occasionally due to loneliness and feelings of inadequacy. What better place to post this than (where I think) Evans is, home of L&S advising. "},{"undefined":"LatLng(37.87335, -122.25826)","lat":37.87335,"long":-122.25826,"message":"I cry all the time, mostly due to frustration but also occasionally due to loneliness and feelings of inadequacy. What better place to post this than (where I think) Evans is, home of L&S advising. "},{"undefined":"LatLng(37.87208, -122.2535)","lat":37.87208,"long":-122.2535,"message":"Stress/anxiety over grades, future, and what I'm doing with my life"},{"undefined":"LatLng(37.869, -122.26027)","lat":37.869,"long":-122.26027,"message":"Having trouble with stress, friends, and work"},{"undefined":"LatLng(37.87184, -122.2623)","lat":37.87184,"long":-122.2623,"message":"I was in the VSLB library and I just started to cry because I felt inadequate compared to the rest of my peers. I felt like everyone else was really knew what they wanted to do in life and was succeeding in getting internships, or other really cool opportunities, and I was just sitting there unmotivated, hating myself for not being someone else."},{"undefined":"LatLng(37.87508, -122.26125)","lat":37.87508,"long":-122.26125,"message":"I cried at the Daily Cal :,-) "},{"undefined":"LatLng(37.86658, -122.25988)","lat":37.86658,"long":-122.25988,"message":"Friends letting me down"},{"undefined":"LatLng(37.87304, -122.2559)","lat":37.87304,"long":-122.2559,"message":"McDonald's ran out of szechuan sauce"},{"undefined":"LatLng(37.87036, -122.25508)","lat":37.87036,"long":-122.25508,"message":"My boyfriend at the time broke up with me unexpectedly outside of Wurster late one night. I was a total mess and sat there sobbing as people walked by looking concerned. A couple of years later they started construction on the area and began demolishing the spot, which felt almost poetically fitting. "},{"undefined":"LatLng(37.87363, -122.25427)","lat":37.87363,"long":-122.25427,"message":"Undergraduate graduation, happy (bittersweet) with my daughter next to me.  For many reasons it was an exceedingly emotional day.  Yep, cried in public at Berkeley when I almost made it through dry-eyed. It felt better looking around though, a lot of intense feelings graduates were experiencing.  Go Bears!!"},{"undefined":"LatLng(37.87033, -122.25387)","lat":37.87033,"long":-122.25387,"message":"Leaving my grad seminar where all the phd students perform for the professor & all of life becomes theory, I felt a deep sadness at the detached nature of academia, and asked myself what I'm doing here. "},{"undefined":"LatLng(37.8754, -122.25893)","lat":37.8754,"long":-122.25893,"message":"Applying to grad school and recruiting and research and attempting to balance everything and a social life"},{"undefined":"LatLng(37.87307, -122.25878)","lat":37.87307,"long":-122.25878,"message":"I got my first rejection when applying for post-graduation jobs in senior year"},{"undefined":"LatLng(37.86926, -122.25419)","lat":37.86926,"long":-122.25419,"message":"Too much wine on a Thursday"},{"undefined":"LatLng(37.87468, -122.25871)","lat":37.87468,"long":-122.25871,"message":"Left 61B exam only to get back my score for Math 1B :( "},{"undefined":"LatLng(37.86927, -122.25769)","lat":37.86927,"long":-122.25769,"message":"Learned my aunt passed away during a History discussion section. My GSI wouldn’t let me leave so I cried in the 15-person roundtable discussion. "},{"undefined":"LatLng(37.86791, -122.25451)","lat":37.86791,"long":-122.25451,"message":"Shedding a tear listening to Drake thinking about the insignificance of my life"},{"undefined":"LatLng(37.87121, -122.26373)","lat":37.87121,"long":-122.26373,"message":"Social, academic, financial, physical, emotional, professional inadequacy."},{"undefined":"LatLng(37.8741, -122.2562)","lat":37.8741,"long":-122.2562,"message":"During lecture while watching a documentary and realizing all the injustices my father has and will go through."},{"undefined":"LatLng(37.87625, -122.25978)","lat":37.87625,"long":-122.25978,"message":"Existential crisis about where I fit into the world and this intense political culture we are currently in. Right before I took a midterms of course. "},{"undefined":"LatLng(37.87219, -122.26271)","lat":37.87219,"long":-122.26271,"message":"It was freshman year and I had just left MCB office hours, listening to other students nod like \"Oh yeah I get it\" with me sitting there like \"I have no idea what everyone's talking about,\" feeling so deep in over my head with no idea how I was going to pass my class. Cried for a while near the willow tree on a sunny day wondering what I was going to do."},{"undefined":"LatLng(37.86977, -122.26818)","lat":37.86977,"long":-122.26818,"message":"Said goodbye to my long distance partner at the BART station"},{"undefined":"LatLng(37.87009, -122.2641)","lat":37.87009,"long":-122.2641,"message":"While meeting with a counselor and being overwhelmed with academics, classes, grades, midterms, and work all while juggling responsibilities of being a parent"},{"undefined":"LatLng(37.86998, -122.25891)","lat":37.86998,"long":-122.25891,"message":"I got a call here about yet another job rejection. I had had four interviews with this law firm and the law firm had basically implied I was guaranteed the job. I felt completely humiliated and I just let myself cry with everyone passing me. I even called my mom and apologized for being such a failure of a daughter. I told her that I was sorry that she had given up everything to move into this country and at that moment I felt completely helpless and hopeless. "},{"undefined":"LatLng(37.87028, -122.25916)","lat":37.87028,"long":-122.25916,"message":"After I got my first Berkeley math midterm back, I sat on this bench near Sproul and called my mom to tell her about my score.  I hadn't gotten used to Berkeley grades yet, so I was in shock that I had gotten the average.  I was trying not to cry and be rational about it, but I heard my mom's voice and broke down.  But thanks to her comforting words, I have learned that it's totally fine to not be perfect :)"},{"undefined":"LatLng(37.87279, -122.25746)","lat":37.87279,"long":-122.25746,"message":"Literally cried in LeConte on Wednesday to a friend because my life is trash and I'm going to die alone. "},{"undefined":"LatLng(37.86946, -122.25915)","lat":37.86946,"long":-122.25915,"message":"I was attending Nick Leslie's eulogy, and I could not stop crying because I could not believe such a great guy could be taken away in such a horrific way. I felt at loss with humanity. "},{"undefined":"LatLng(37.87184, -122.26177)","lat":37.87184,"long":-122.26177,"message":"Started crying during lecture because I felt overwhelmed by the weight of all the things that have been bothering me. I've been seeing a therapist at the Tang Center for the past couple months to try and work through some of my issues, but there hasn't been much improvement.\n\nNo one seemed to notice that I was crying. Or  if they did, they didn't say anything. "},{"undefined":"LatLng(37.86966, -122.25949)","lat":37.86966,"long":-122.25949,"message":"My life was going fine and then everything just went to complete shit. I was crying every day for over a month for so many reasons -- not at all happy with where I was in my life, someone I thought was one of my best friends completely let me down, all my old friends felt distant, I let a guy break my heart for the third time, I had no motivation in any of my classes, I closed myself off to new people, and I just felt so fucking alone."},{"undefined":"LatLng(37.87363, -122.25707)","lat":37.87363,"long":-122.25707,"message":"My first semester at Berk, I was having a really hard time adjusting. The closer it got to the end of the semester, the more homesick and lonely I felt. I sat around the fountain in Hearst Mining Circle and cried  uncontrollably for a long time. This campus can feel really big and unfriendly, especially to a shy introvert who finds it difficult to put herself out there. "},{"undefined":"LatLng(37.87049, -122.25511)","lat":37.87049,"long":-122.25511,"message":"Got in a phone-fight with my mom. It's hard when you're a first-gen american and college student. Sometimes people act like that's a cliché; the whole \"challenges of being first gen\" thing. But moving away for an experience that your parents haven't had can be scary for them. Mine often lash out. "},{"undefined":"LatLng(37.87349, -122.25555)","lat":37.87349,"long":-122.25555,"message":"build up of stress / questioning of my academic ability culminating in me crying when i was 2 minutes late to my ochem lab and my gsi didn't let me do the lab - basically broke down crying  and giving up "},{"undefined":"LatLng(37.87438, -122.25839)","lat":37.87438,"long":-122.25839,"message":"In front of a professor whose class I was failing. Admitting I was experiencing and seeking help for severe depression and anxiety that semester made me feel worthless and pathetic."},{"undefined":"LatLng(37.86787, -122.25899)","lat":37.86787,"long":-122.25899,"message":"Social anxiety after a club meeting"},{"undefined":"LatLng(37.87229, -122.25884)","lat":37.87229,"long":-122.25884,"message":"Amidst a hard part of the semester, I headed to stacks to study with a friend. They gave me directions (that turned out to be wrong) and I couldn't find them. After wandering around B level for ten minutes I went between two rows of bookshelves and broke down from the frustration."},{"undefined":"LatLng(37.8713, -122.26414)","lat":37.8713,"long":-122.26414,"message":"I was in a meeting in Tolman when I got a call saying I didn't get the job I was interviewing for. I was sad and stressed and disappointed so after the meeting I went to go cry in the eucalyptus grove."},{"undefined":"LatLng(37.86865, -122.25917)","lat":37.86865,"long":-122.25917,"message":"Tear gas"},{"undefined":"LatLng(37.87383, -122.26494)","lat":37.87383,"long":-122.26494,"message":"Started breaking down in front of my grad student feeling overwhelmed from messing up in lab, piles of schoolwork and studying to do, and sleep deprivation."},{"undefined":"LatLng(37.86574, -122.26093)","lat":37.86574,"long":-122.26093,"message":"Feeling lonely."},{"undefined":"LatLng(37.87265, -122.26457)","lat":37.87265,"long":-122.26457,"message":"Feeling scared about my future. I've been working towards a path in medicine for over four years, and hearing others around me getting great interviews while I wasn't made me really question my self worth. "},{"undefined":"LatLng(37.86994, -122.25824)","lat":37.86994,"long":-122.25824,"message":"Frustration with cal central "},{"undefined":"LatLng(37.87072, -122.26157)","lat":37.87072,"long":-122.26157,"message":"Stress about getting into Haas and family problems. "},{"undefined":"LatLng(37.87157, -122.24977)","lat":37.87157,"long":-122.24977,"message":"I was in my second semester of freshman year and I've been failing all my classes. That sem was particularly difficult 'cause I had Chem 4B, Math 1B, Physics 8A, R&C5B, and Psy 1. I just turned in my third paper for  Psy 1 a couple minutes late, which meant my score was automatically cut by half. I was guaranteed to get a B (which I did). I felt like my presence at Cal was a mistake b/c people said Psy 1 was easy A. I remember it had just rained and the trail was muddy and slippery, but I decided to climbed to the big C anyways b/c I needed a place to cry alone for hours. I couldn't find the big C, so ended up sitting at the Tightward Hill, crying and staring at the stadium for hours."},{"undefined":"LatLng(37.86583, -122.25857)","lat":37.86583,"long":-122.25857,"message":"I was talking to my sort-of-but-undefined long distance boyfriend on the phone. He hadn't called me in a week and I was completely fried writing my thesis. I worried about where we stood but was too afraid to ask."},{"undefined":"LatLng(37.87343, -122.25604)","lat":37.87343,"long":-122.25604,"message":"At first I couldn't understand the physics lecture. Then my frustration expanded to how I struggle so much in other STEM subjects (despite the fact that I'm a STEM major) and how I didn't believe I had other redeemable traits. I felt stupid for not being able to understand the material, for choosing to do something I'm bad at, and for possibly wasting my entire time at Berkeley. I felt like a waste of space. "},{"undefined":"LatLng(37.87292, -122.26527)","lat":37.87292,"long":-122.26527,"message":"I bombed my 6th final exam and cried in the hallway. I took on 21 units that semester because I felt inadequate and that I was doing \"too little.\""},{"undefined":"LatLng(37.87135, -122.257)","lat":37.87135,"long":-122.257,"message":"Got asked to sight sing a hard passage on the spot in front of the whole class and I choked. I started crying about halfway through "},{"undefined":"LatLng(37.86818, -122.25536)","lat":37.86818,"long":-122.25536,"message":"The loud chatter and laughter from people at Unit 3 for CalSo made my social anxiety kick in. I ended up ditching CalSo even though I paid for it. "},{"undefined":"LatLng(37.87113, -122.26078)","lat":37.87113,"long":-122.26078,"message":"I was studying with my roommate in Dwinelle, and after she left I cried because I realized that I would never be as smart or hardworking as her and (seemingly) all the other students at Cal"},{"undefined":"LatLng(37.86978, -122.25959)","lat":37.86978,"long":-122.25959,"message":"My ex told me that he didn't want to be friends anymore. "},{"undefined":"LatLng(37.87158, -122.25748)","lat":37.87158,"long":-122.25748,"message":"Unhelpful counselor @cogsci department"},{"undefined":"LatLng(37.86687, -122.2584)","lat":37.86687,"long":-122.2584,"message":"Realized my take home midterm was due that night not in 3 days"},{"undefined":"LatLng(37.87084, -122.26298)","lat":37.87084,"long":-122.26298,"message":"Thought I failed my gen chem final... then I took ochem 🙃🙃"},{"undefined":"LatLng(37.8733, -122.25938)","lat":37.8733,"long":-122.25938,"message":"I missed my boyfriend, who had recently dropped out. I just really wished he could've been there with me to enjoy the beautiful day on the Glade."},{"undefined":"LatLng(37.87042, -122.26031)","lat":37.87042,"long":-122.26031,"message":"In my first semester here I got so sick that I had to leave my math discussion in Dwinelle because I was coughing so much. I was completely overwhelmed, felt like my body was failing me and was worried I couldn't take care of my health while living on my own. "},{"undefined":"LatLng(37.87523, -122.25749)","lat":37.87523,"long":-122.25749,"message":"CS wrecked me"},{"undefined":"LatLng(37.8734, -122.25444)","lat":37.8734,"long":-122.25444,"message":"My boyfriend told me he never loved me. He just didn't like seeing me happy with other people."},{"undefined":"LatLng(37.87489, -122.25809)","lat":37.87489,"long":-122.25809,"message":"I was failing a class. I studied and studied and studied, but nothing was sticking. I was three days into dead week and I couldn't take it anymore. I broke down in a classroom and sobbed my heart out. I had never felt so alone in my life."},{"undefined":"LatLng(37.87058, -122.26062)","lat":37.87058,"long":-122.26062,"message":"I was really stressed out because of a project. Then I had a paper stacked on top. My teammates tried to take credit for my work and the paper, though I did most of the work. One even asked me to be a reference for how he was a hard worker and great at coding. I was in the office hours for another class and I broke down in tears. "},{"undefined":"LatLng(37.86998, -122.25723)","lat":37.86998,"long":-122.25723,"message":"walking to class the day after the election "},{"undefined":"LatLng(37.8798, -122.27253)","lat":37.8798,"long":-122.27253,"message":"in the shower, felt that none of my friends really cared about me because no one really remembered my birthday nor cared to check up on me at at all "},{"undefined":"LatLng(37.86839, -122.26038)","lat":37.86839,"long":-122.26038,"message":"Realized I was going to graduate with no future plans or prospects "},{"undefined":"LatLng(37.87545, -122.26056)","lat":37.87545,"long":-122.26056,"message":"Unrequited love "},{"undefined":"LatLng(37.8687, -122.25811)","lat":37.8687,"long":-122.25811,"message":"I had a panic attack during a review session for a final and had to rush out of the room before it was over; I was and crying on the phone to my mom here."},{"undefined":"LatLng(37.86904, -122.25966)","lat":37.86904,"long":-122.25966,"message":"In MLK when I got rejection from HAAS"},{"undefined":"LatLng(37.87401, -122.25998)","lat":37.87401,"long":-122.25998,"message":"failed the first class of my life "},{"undefined":"LatLng(37.87404, -122.257)","lat":37.87404,"long":-122.257,"message":"My best friend was hospitalized for mental health reasons, the hardest lab report of my life was due the next day, I'd been dealing with realizing I'm trans, and I had just gotten news of my grandfather's passing as I was walking to class to give a presentation. "},{"undefined":"LatLng(37.87154, -122.26172)","lat":37.87154,"long":-122.26172,"message":"As I was studying for two midterms @2am-ish, I just had a mental breakdown of how I hated life so much because of Cal.   )':')"},{"undefined":"LatLng(37.8758, -122.25637)","lat":37.8758,"long":-122.25637,"message":"Homesick for the first time in my freshman year. Couldn't deal with anything. I had no friends who I could call my own. Being an international student in this country, I felt like an outsider and nobody really reciprocated any of my efforts to try to reach out and just have... someone there for me."},{"undefined":"LatLng(37.86906, -122.25238)","lat":37.86906,"long":-122.25238,"message":"existential dread & loneliness"},{"undefined":"LatLng(37.8742, -122.25813)","lat":37.8742,"long":-122.25813,"message":"I got dumped during my 2nd week of college. I cried in the outdoor patio outside of the engineering buildings. I previously loved that spot, and after this moment, never stepped foot on that patio again."},{"undefined":"LatLng(37.87252, -122.2611)","lat":37.87252,"long":-122.2611,"message":"I was studying for an ochem midterm on moffitt 4th floor when I realized just how much was on the test. After writing out everything I needed to know, I made a lil’ white board fort around me, put my head down, and cried for a while. "},{"undefined":"LatLng(37.86908, -122.24992)","lat":37.86908,"long":-122.24992,"message":"Started crying on the steps of what is now Delta Sigma because I got dumped."},{"undefined":"LatLng(37.85656, -122.26339)","lat":37.85656,"long":-122.26339,"message":"I cry in MLK pretty frequently, especially on the second floor.  I like it a lot because you can be sitting at one of the tables and cry silently without people asking if you're okay--you can just cry without feeling the pressure of people feeling uncomfortable, I think?   It's a place where people really respect the precept of mind your own business, and I think it's better to cry in a comfy MLK chair after a midterm gone awry or class rejection rather than a bench outside."},{"undefined":"LatLng(37.86688, -122.25794)","lat":37.86688,"long":-122.25794,"message":"After sitting through an unproductive mediation session with a hostile roommate and the residential director"},{"undefined":"LatLng(37.86764, -122.26896)","lat":37.86764,"long":-122.26896,"message":"Reading a Facebook post about first generation students, reminded me of the sacrifices my parents made. Cried further because of a stressful week of midterms and just being mediocre. I’m scared of just being average. I don’t understand why as a junior I still haven’t gotten accustomed to UCB. "},{"undefined":"LatLng(37.86994, -122.26114)","lat":37.86994,"long":-122.26114,"message":"I found out my father passed away during my 8 AM Spanish class. My mom called me three times before I finally stepped out to picked up stuff. I left class without saying a word. "},{"undefined":"LatLng(37.86617, -122.24658)","lat":37.86617,"long":-122.24658,"message":"I wasn't doing anywhere near as well in school as I had too, and all of my roommates and floor mates were talking about moving into apartments. I didn't have to worry about that, because my family didn't have the money for it and I was going to commute from home. Also, my boyfriend and I started having a lot of problems around this time. I felt alone because my entire support group was inaccessible and everything seemed so difficult. Things haven't improved since then, so I've been crying a lot more than I ever used to. But I still remember the spot where I started crying and never really stopped."},{"undefined":"LatLng(37.87214, -122.26037)","lat":37.87214,"long":-122.26037,"message":"general fears that everyone hates me"},{"undefined":"LatLng(37.87148, -122.26466)","lat":37.87148,"long":-122.26466,"message":"I was calling my best friend who is across the country and I cried because I missed him so much. "},{"undefined":"LatLng(37.87136, -122.26214)","lat":37.87136,"long":-122.26214,"message":"After my grandfather's funeral and a multitude of midterms, I had to see an academic advisor to approve my class schedule. He \"advised\" me to look for a career path other than medicine, as if I didn't doubt myself enough. "},{"undefined":"LatLng(37.87048, -122.25363)","lat":37.87048,"long":-122.25363,"message":"Family problems"},{"undefined":"LatLng(37.86874, -122.26041)","lat":37.86874,"long":-122.26041,"message":"Learned a beloved teacher from high school passed away"},{"undefined":"LatLng(37.87189, -122.26231)","lat":37.87189,"long":-122.26231,"message":"Cried right after walking out of CS61B midterm 2 (I knew I failed)"},{"undefined":"LatLng(37.87062, -122.26058)","lat":37.87062,"long":-122.26058,"message":"Went to the inside plaza in Dwinelle and called my mom and started bawling bc of how shitty pledging was"},{"undefined":"LatLng(37.86667, -122.25958)","lat":37.86667,"long":-122.25958,"message":"Broke down when I learned someone I liked for a very long time is in a relationship"},{"undefined":"LatLng(37.87263, -122.26416)","lat":37.87263,"long":-122.26416,"message":"Life sucks"},{"undefined":"LatLng(37.87031, -122.26048)","lat":37.87031,"long":-122.26048,"message":"Sleep-deprived and stressed."},{"undefined":"LatLng(37.87374, -122.25929)","lat":37.87374,"long":-122.25929,"message":"Realized I wasn't as smart as I thought I was."},{"undefined":"LatLng(37.86991, -122.25517)","lat":37.86991,"long":-122.25517,"message":"I was sick and had an audition and it was raining so i just cried."},{"undefined":"LatLng(37.87707, -122.26045)","lat":37.87707,"long":-122.26045,"message":"Walking out of my apartment on the last day of our lease. It had been my toughest and best year at Cal. Some of my favorite memories had happened there, and I considered it home. "},{"undefined":"LatLng(37.87538, -122.25515)","lat":37.87538,"long":-122.25515,"message":"School,work,internship,social life, family commitments all came crashing down at one time and it was just too much so I broke down and cried."},{"undefined":"LatLng(37.87168, -122.25681)","lat":37.87168,"long":-122.25681,"message":"It was my birthday freshman year, which happened to fall on my most stressful day of the semester. I was also really lonely, and missed home. It all overwhelmed me, and I cried in that knotty wizened tree near faculty glade. "},{"undefined":"LatLng(37.8696, -122.25343)","lat":37.8696,"long":-122.25343,"message":"I was trying to explain to a friend/someone I work with that I couldn’t do parts of my job because of my anxiety. I had never talked about my anxiety with more than one person before, ended up having an anxiety attack and ran to cry in the bathroom. "},{"undefined":"LatLng(37.87015, -122.25855)","lat":37.87015,"long":-122.25855,"message":"I saw Milo"},{"undefined":"LatLng(37.87028, -122.25655)","lat":37.87028,"long":-122.25655,"message":"Questioning my life as an architecture major who is always sleep deprived from pulling all nighters and never gets to have fun"},{"undefined":"LatLng(37.87296, -122.26689)","lat":37.87296,"long":-122.26689,"message":"I woke up one night, realizing I'd missed a date earlier that day. My phone was overflowing with texts from her. I prayed she wouldn't break up with me. She did. She told me she's leaving me for another guy. I cried really badly that night."},{"undefined":"LatLng(37.86405, -122.25595)","lat":37.86405,"long":-122.25595,"message":"I lost my virginity one night at a party. I was feeling proud of myself when I realized I hadn't used a condom. Thankfully, everything turned out alright, but I didn't know for a couple weeks. I cried almost every night during those weeks."},{"undefined":"LatLng(37.87173, -122.26114)","lat":37.87173,"long":-122.26114,"message":"I was studying late in a library with some friends during my first semester of freshman year. My mom called me and I went outside to talk to her. Suddenly, I burst into tears from the overwhelming stress of midterms and the heavy weight on my chest of having to decide what I wanted to do with my life. I felt so directionless, like I was guessing at my interests and major and potentially guessing wrong. I finished up the conversation, cleaned up my face, and went back to the library to study with my friends."},{"undefined":"LatLng(37.86834, -122.26282)","lat":37.86834,"long":-122.26282,"message":"I walked out of my math 54 final exam at the end of my first semester of freshman year, having left half the pages blank because I just didn't know how to solve the problems. I'd never felt so helpless and stupid in my life. I called my mom and sobbed to her, making plans to drop out of Berkeley due to an abysmal GPA, trying to convince myself that I could transfer to an easier school and still be successful. I knew I had failed the exam. In a way, I wasn't wrong - I got a 52%, but the average was 48%, so I still got a B+ in the class. That was, for me, an introduction to what studying at Berkeley was like. What kind of professor would write an exam that the majority of their students get an F in? A Berkeley professor. "},{"undefined":"LatLng(37.87106, -122.26204)","lat":37.87106,"long":-122.26204,"message":"I saw my ex-boyfriend. "},{"undefined":"LatLng(37.8739, -122.25593)","lat":37.8739,"long":-122.25593,"message":"Horrible first day of lab."},{"undefined":"LatLng(37.86941, -122.25578)","lat":37.86941,"long":-122.25578,"message":"My Dad called to tell me my Papaw passed away."}]}
