{"events":[{"lat":37.866805,"long":-122.257511,"message":"Stress and personal reasons"},{"lat":37.871206,"long":-122.259353,"message":"The last time was from being overwhelmed by school and life in general, the second being rejection from a creative writing class, and the first time being rejection from the first club I ever applied to at Cal at the beginning of my freshman year"},{"lat":37.873211,"long":-122.264308,"message":"CS61B Project 1 final office hours before the project was due had just ended and my project wasn't complete and I still needed help. "},{"lat":37.875146,"long":-122.25755,"message":"existential crisis about my future"},{"lat":37.867715,"long":-122.255647,"message":"Friend/Relationship Drama, Anxiety attack, stress"},{"lat":37.872684,"long":-122.261005,"message":"Realized I was going to fail my midterm and also had like 100 other stressful things on my mind"},{"lat":37.872743,"long":-122.260608,"message":"Stressed about midterms, general anxiety "},{"lat":37.867448,"long":-122.264243,"message":"During my freshman year, I was getting birth control for the first time and was seeing a physician about it. During my consultation I ended up fainting and had to sit in the waiting room with my prescription alone for like 15 minutes because the doctor had to move on to other patients. I went to the bathroom in Tang and cried for like 10 minutes once I got to leave but couldn't really tell anyone because I so embarrassed on various levels."},{"lat":37.866352,"long":-122.254402,"message":"Boy problems"},{"lat":37.872557,"long":-122.260597,"message":"Everything "},{"lat":37.867002,"long":-122.259901,"message":"Stress"},{"lat":37.869929,"long":-122.257661,"message":"Just got word that my father suddenly passed away"},{"lat":37.876555,"long":-122.26023,"message":"Work from chem 3b, clubs,  sleep deprivation,  math,  and missing roommate"},{"lat":37.87285,"long":-122.257029,"message":"My life is in shambles!"},{"lat":37.875394,"long":-122.260535,"message":"My daily catharsis"},{"lat":37.867417,"long":-122.260065,"message":"Stress"},{"lat":37.869607,"long":-122.258548,"message":"I had just come out of Asian American Studies R2A, which I was taking over summer. The class was the first time I had dealt with so many issues regarding my identity, specifically coming to terms with my non-heterosexualness. One day, discussion was open to reflecting upon our identities. It was the first time I had talked about my sexuality in such a serious manner, and I bawled my eyes out. The last time I had cried was 7 years ago, so one could imagine how overwhelming yet cathartic the experience was. Once class ended, my friend took care of me, and came with me to Sproul Plaza where I continued to cry for half an hour on that patch of grass."},{"lat":37.872213,"long":-122.257347,"message":"Freaking out about indirect criticism at work that made me feel insecure about my skills at my job."},{"lat":37.871312,"long":-122.256781,"message":"Failed my first midterm"},{"lat":37.874297,"long":-122.2666,"message":"i was sad because i was in a fight with a friend"},{"lat":37.874339,"long":-122.266605,"message":"I failed :("},{"lat":37.872371,"long":-122.260769,"message":"laughing too much!!"},{"lat":37.872328,"long":-122.259756,"message":"I have a mental health condition (GAD) and I cry a lot when I experience stressful confusion or deadlines that trigger my anxiety or give me a panic attack. "},{"lat":37.873954,"long":-122.259566,"message":"Because the maps library was closed :( I love maps"},{"lat":37.869006,"long":-122.254786,"message":"General sadness"},{"lat":37.867913,"long":-122.255356,"message":"Orientation was incredibly overwhelming"},{"lat":37.867989,"long":-122.254712,"message":"My boyfriend was leaving for college and that day was the last time I'd see him for months"},{"lat":37.874018,"long":-122.256298,"message":"I was only able to finish half of my midterm and everyone else finished early"},{"lat":37.870699,"long":-122.260611,"message":"The weight of the world and existential despair"},{"lat":37.875163,"long":-122.260484,"message":"I was in the office the day of the Las Vegas shooting, and had woken up to a breaking news story about the shooting. Someone mentioned that there were some shots fired at USC, where my friend attends. I was worried about her safety. Thankfully, it was a false alarm, the reports of shots fired at USC were false."},{"undefined":"LatLng(37.86743, -122.2647)","lat":37.86743,"long":-122.2647,"message":"After months of mounting anxiety during a very stressful school year, I got a horrible flu which basically triggered an ongoing panic attack. In the aftermath, I couldn't breathe in class one day, and I left and walked to Tang to seek help at the mental health clinic. While speaking with someone, I couldn't help but cry. It was so scary, and yet such a relief, to admit how much I'd been struggling. The help I got that day and after has been formative in my life since. "},{"undefined":"LatLng(37.87341, -122.26427)","lat":37.87341,"long":-122.26427,"message":"Grad life"},{"undefined":"LatLng(37.86852, -122.26041)","lat":37.86852,"long":-122.26041,"message":"I was studying in Moffit during my second year when my Dad called me from India to tell me that my grandfather passed. He asked me if I was OK, and I said I would just go home. I thought I would hold it in till I walked there but I happened to run into the two first friends that I made at Cal on the way home. One of them hugged me to greet me, and I burst into tears and stayed in that hug for a long time."},{"undefined":"LatLng(37.87084, -122.25859)","lat":37.87084,"long":-122.25859,"message":"I've cried on the bench across from Wheeler overlooking Strawberry Creek at least 6 times since last spring. The last time it was because all of my friends have graduated and I constantly feel alone; before that, it was from anxiety about all of my deadlines and imposter syndrome; & before that, it was because I had just come from a class where one of my classmates was stalking me and sending me aggressive messages and the department had told me the day before that they couldn't do anything about it."},{"undefined":"LatLng(37.86981, -122.25899)","lat":37.86981,"long":-122.25899,"message":"I was stressed out about life: upcoming midterms, missing home, and just wanting some sleep. I found a lonely staircase and cried until I felt better. "},{"undefined":"LatLng(37.86964, -122.26805)","lat":37.86964,"long":-122.26805,"message":"I cried because Berkeley is no longer the #1 public university"},{"undefined":"LatLng(37.86948, -122.25663)","lat":37.86948,"long":-122.25663,"message":"I was really overwhelmed with academics and personal things. I tried to keep my struggles hidden and told nobody about what was going on. Eventually, all that stress just got to me and I had a major mental/emotional breakdown."},{"undefined":"LatLng(37.87157, -122.25178)","lat":37.87157,"long":-122.25178,"message":"I felt like I was losing a friend. A really close friend. "},{"undefined":"LatLng(37.87385, -122.2596)","lat":37.87385,"long":-122.2596,"message":"stress and relationship"},{"undefined":"LatLng(37.86963, -122.25192)","lat":37.86963,"long":-122.25192,"message":"Overwhelmed by work, a romantic relationship, family pressure, academic success, and an existential crisis. "},{"undefined":"LatLng(37.87257, -122.26072)","lat":37.87257,"long":-122.26072,"message":"fighting with significant other"},{"undefined":"LatLng(37.8705, -122.26031)","lat":37.8705,"long":-122.26031,"message":"had a devastating midterm"},{"undefined":"LatLng(37.87128, -122.26357)","lat":37.87128,"long":-122.26357,"message":"As an undergrad in a lab, I gave a lab meeting  presentation I thought was solid.  It was torn apart, just really, ripped to pieces. Academic achievement had been such a core part of my personality until then, that I didn't know how to process being wrong without taking it personally."},{"undefined":"LatLng(37.87147, -122.26037)","lat":37.87147,"long":-122.26037,"message":"all nighters in Moffitt!!!"},{"undefined":"LatLng(37.86782, -122.25896)","lat":37.86782,"long":-122.25896,"message":"Felt so rejected, low, stressed and hungry"},{"undefined":"LatLng(37.8696, -122.25549)","lat":37.8696,"long":-122.25549,"message":"I was upset with my roommate and needed to go outside and have a good cry at how crappy my day had been"},{"undefined":"LatLng(37.87089, -122.25071)","lat":37.87089,"long":-122.25071,"message":"we lost again"},{"undefined":"LatLng(37.87285, -122.2626)","lat":37.87285,"long":-122.2626,"message":"I usually get stress out about classes and work. Maybe it's hormonal or not but I go to the bathroom and cry. "},{"undefined":"LatLng(37.86857, -122.27174)","lat":37.86857,"long":-122.27174,"message":"I taught a lesson in front of my supervisor and didn't feel that great about it and my supervisor was giving me all these suggestions but it felt like I had all these deficits and I started thinking about my decision to become a teacher."},{"undefined":"LatLng(37.87235, -122.26035)","lat":37.87235,"long":-122.26035,"message":"I cried because transferring is hard, and I wasn't able to meet the standards set by myself and others."},{"undefined":"LatLng(37.87119, -122.26014)","lat":37.87119,"long":-122.26014,"message":"I had finally gotten into the last course I needed to declare, but I hated the way the professor was teaching the material. I didn't know if I was making the right decision to declare, but it was also too late in my academic career to declare anything else. I cried in front of my academic counselor even when I knew that she didn't give a damn about who I was as an individual."},{"undefined":"LatLng(37.87488, -122.25936)","lat":37.87488,"long":-122.25936,"message":"I got a D in a class in my second to last semester and cried to my advisor about my fears of not graduating and how stupid I felt for getting a D."},{"undefined":"LatLng(37.86618, -122.25877)","lat":37.86618,"long":-122.25877,"message":"Intermezzo was still around. I was enjoying my favorite salad when I got the phone call that my grandmother had finally been relieved of her suffering from breast cancer. I stood at the intersection, facing all the oncoming Telegraph traffic, and let it go."},{"undefined":"LatLng(37.8692, -122.25776)","lat":37.8692,"long":-122.25776,"message":"I had a physics midterm and I couldn't do a single question.  I held in my cries during the actual exam, but cried in my floormate's arms after."},{"undefined":"LatLng(37.86904, -122.25968)","lat":37.86904,"long":-122.25968,"message":"I ve begun the coming out process and have been feeling very vulnerable and anxious lately. I visited the Marsha P. Johnson lounge in MLK for the first time and felt a sense of comfort that I hadn t experienced in a while."},{"undefined":"LatLng(37.87241, -122.25801)","lat":37.87241,"long":-122.25801,"message":"i watched the 1-800 video and cried like a baby in Stanley Hall"},{"undefined":"LatLng(37.86762, -122.2588)","lat":37.86762,"long":-122.2588,"message":"i was a freshman in the midst of apartment hunting and things just kept not working out and everyone around me had found a place to stay already. it seemed impossible with the housing crisis on top of my limited financial means, so one night i just broke down in fear that i would be homeless next year."},{"undefined":"LatLng(37.87335, -122.25826)","lat":37.87335,"long":-122.25826,"message":"I cry all the time, mostly due to frustration but also occasionally due to loneliness and feelings of inadequacy. What better place to post this than (where I think) Evans is, home of L&S advising. "},{"undefined":"LatLng(37.87335, -122.25826)","lat":37.87335,"long":-122.25826,"message":"I cry all the time, mostly due to frustration but also occasionally due to loneliness and feelings of inadequacy. What better place to post this than (where I think) Evans is, home of L&S advising. "},{"undefined":"LatLng(37.87208, -122.2535)","lat":37.87208,"long":-122.2535,"message":"Stress/anxiety over grades, future, and what I'm doing with my life"},{"undefined":"LatLng(37.869, -122.26027)","lat":37.869,"long":-122.26027,"message":"Having trouble with stress, friends, and work"},{"undefined":"LatLng(37.87184, -122.2623)","lat":37.87184,"long":-122.2623,"message":"I was in the VSLB library and I just started to cry because I felt inadequate compared to the rest of my peers. I felt like everyone else was really knew what they wanted to do in life and was succeeding in getting internships, or other really cool opportunities, and I was just sitting there unmotivated, hating myself for not being someone else."},{"undefined":"LatLng(37.87508, -122.26125)","lat":37.87508,"long":-122.26125,"message":"I cried at the Daily Cal :,-) "},{"undefined":"LatLng(37.86658, -122.25988)","lat":37.86658,"long":-122.25988,"message":"Friends letting me down"},{"undefined":"LatLng(37.87304, -122.2559)","lat":37.87304,"long":-122.2559,"message":"McDonald's ran out of szechuan sauce"},{"undefined":"LatLng(37.87036, -122.25508)","lat":37.87036,"long":-122.25508,"message":"My boyfriend at the time broke up with me unexpectedly outside of Wurster late one night. I was a total mess and sat there sobbing as people walked by looking concerned. A couple of years later they started construction on the area and began demolishing the spot, which felt almost poetically fitting. "},{"undefined":"LatLng(37.87363, -122.25427)","lat":37.87363,"long":-122.25427,"message":"Undergraduate graduation, happy (bittersweet) with my daughter next to me.  For many reasons it was an exceedingly emotional day.  Yep, cried in public at Berkeley when I almost made it through dry-eyed. It felt better looking around though, a lot of intense feelings graduates were experiencing.  Go Bears!!"},{"undefined":"LatLng(37.87033, -122.25387)","lat":37.87033,"long":-122.25387,"message":"Leaving my grad seminar where all the phd students perform for the professor & all of life becomes theory, I felt a deep sadness at the detached nature of academia, and asked myself what I'm doing here. "},{"undefined":"LatLng(37.8754, -122.25893)","lat":37.8754,"long":-122.25893,"message":"Applying to grad school and recruiting and research and attempting to balance everything and a social life"},{"undefined":"LatLng(37.87307, -122.25878)","lat":37.87307,"long":-122.25878,"message":"I got my first rejection when applying for post-graduation jobs in senior year"},{"undefined":"LatLng(37.86926, -122.25419)","lat":37.86926,"long":-122.25419,"message":"Too much wine on a Thursday"},{"undefined":"LatLng(37.87468, -122.25871)","lat":37.87468,"long":-122.25871,"message":"Left 61B exam only to get back my score for Math 1B :( "},{"undefined":"LatLng(37.86927, -122.25769)","lat":37.86927,"long":-122.25769,"message":"Learned my aunt passed away during a History discussion section. My GSI wouldn’t let me leave so I cried in the 15-person roundtable discussion. "},{"undefined":"LatLng(37.86791, -122.25451)","lat":37.86791,"long":-122.25451,"message":"Shedding a tear listening to Drake thinking about the insignificance of my life"},{"undefined":"LatLng(37.87121, -122.26373)","lat":37.87121,"long":-122.26373,"message":"Social, academic, financial, physical, emotional, professional inadequacy."},{"undefined":"LatLng(37.8741, -122.2562)","lat":37.8741,"long":-122.2562,"message":"During lecture while watching a documentary and realizing all the injustices my father has and will go through."},{"undefined":"LatLng(37.87625, -122.25978)","lat":37.87625,"long":-122.25978,"message":"Existential crisis about where I fit into the world and this intense political culture we are currently in. Right before I took a midterms of course. "},{"undefined":"LatLng(37.87219, -122.26271)","lat":37.87219,"long":-122.26271,"message":"It was freshman year and I had just left MCB office hours, listening to other students nod like \"Oh yeah I get it\" with me sitting there like \"I have no idea what everyone's talking about,\" feeling so deep in over my head with no idea how I was going to pass my class. Cried for a while near the willow tree on a sunny day wondering what I was going to do."},{"undefined":"LatLng(37.86977, -122.26818)","lat":37.86977,"long":-122.26818,"message":"Said goodbye to my long distance partner at the BART station"},{"undefined":"LatLng(37.87009, -122.2641)","lat":37.87009,"long":-122.2641,"message":"While meeting with a counselor and being overwhelmed with academics, classes, grades, midterms, and work all while juggling responsibilities of being a parent"},{"undefined":"LatLng(37.86998, -122.25891)","lat":37.86998,"long":-122.25891,"message":"I got a call here about yet another job rejection. I had had four interviews with this law firm and the law firm had basically implied I was guaranteed the job. I felt completely humiliated and I just let myself cry with everyone passing me. I even called my mom and apologized for being such a failure of a daughter. I told her that I was sorry that she had given up everything to move into this country and at that moment I felt completely helpless and hopeless. "},{"undefined":"LatLng(37.87028, -122.25916)","lat":37.87028,"long":-122.25916,"message":"After I got my first Berkeley math midterm back, I sat on this bench near Sproul and called my mom to tell her about my score.  I hadn't gotten used to Berkeley grades yet, so I was in shock that I had gotten the average.  I was trying not to cry and be rational about it, but I heard my mom's voice and broke down.  But thanks to her comforting words, I have learned that it's totally fine to not be perfect :)"},{"undefined":"LatLng(37.87279, -122.25746)","lat":37.87279,"long":-122.25746,"message":"Literally cried in LeConte on Wednesday to a friend because my life is trash and I'm going to die alone. "},{"undefined":"LatLng(37.86946, -122.25915)","lat":37.86946,"long":-122.25915,"message":"I was attending Nick Leslie's eulogy, and I could not stop crying because I could not believe such a great guy could be taken away in such a horrific way. I felt at loss with humanity. "},{"undefined":"LatLng(37.87184, -122.26177)","lat":37.87184,"long":-122.26177,"message":"Started crying during lecture because I felt overwhelmed by the weight of all the things that have been bothering me. I've been seeing a therapist at the Tang Center for the past couple months to try and work through some of my issues, but there hasn't been much improvement.\n\nNo one seemed to notice that I was crying. Or  if they did, they didn't say anything. "},{"undefined":"LatLng(37.86966, -122.25949)","lat":37.86966,"long":-122.25949,"message":"My life was going fine and then everything just went to complete shit. I was crying every day for over a month for so many reasons -- not at all happy with where I was in my life, someone I thought was one of my best friends completely let me down, all my old friends felt distant, I let a guy break my heart for the third time, I had no motivation in any of my classes, I closed myself off to new people, and I just felt so fucking alone."},{"undefined":"LatLng(37.87363, -122.25707)","lat":37.87363,"long":-122.25707,"message":"My first semester at Berk, I was having a really hard time adjusting. The closer it got to the end of the semester, the more homesick and lonely I felt. I sat around the fountain in Hearst Mining Circle and cried  uncontrollably for a long time. This campus can feel really big and unfriendly, especially to a shy introvert who finds it difficult to put herself out there. "},{"undefined":"LatLng(37.87049, -122.25511)","lat":37.87049,"long":-122.25511,"message":"Got in a phone-fight with my mom. It's hard when you're a first-gen american and college student. Sometimes people act like that's a cliché; the whole \"challenges of being first gen\" thing. But moving away for an experience that your parents haven't had can be scary for them. Mine often lash out. "},{"undefined":"LatLng(37.87349, -122.25555)","lat":37.87349,"long":-122.25555,"message":"build up of stress / questioning of my academic ability culminating in me crying when i was 2 minutes late to my ochem lab and my gsi didn't let me do the lab - basically broke down crying  and giving up "},{"undefined":"LatLng(37.87438, -122.25839)","lat":37.87438,"long":-122.25839,"message":"In front of a professor whose class I was failing. Admitting I was experiencing and seeking help for severe depression and anxiety that semester made me feel worthless and pathetic."},{"undefined":"LatLng(37.86787, -122.25899)","lat":37.86787,"long":-122.25899,"message":"Social anxiety after a club meeting"},{"undefined":"LatLng(37.87229, -122.25884)","lat":37.87229,"long":-122.25884,"message":"Amidst a hard part of the semester, I headed to stacks to study with a friend. They gave me directions (that turned out to be wrong) and I couldn't find them. After wandering around B level for ten minutes I went between two rows of bookshelves and broke down from the frustration."},{"undefined":"LatLng(37.8713, -122.26414)","lat":37.8713,"long":-122.26414,"message":"I was in a meeting in Tolman when I got a call saying I didn't get the job I was interviewing for. I was sad and stressed and disappointed so after the meeting I went to go cry in the eucalyptus grove."},{"undefined":"LatLng(37.86865, -122.25917)","lat":37.86865,"long":-122.25917,"message":"Tear gas"},{"undefined":"LatLng(37.87383, -122.26494)","lat":37.87383,"long":-122.26494,"message":"Started breaking down in front of my grad student feeling overwhelmed from messing up in lab, piles of schoolwork and studying to do, and sleep deprivation."},{"undefined":"LatLng(37.86574, -122.26093)","lat":37.86574,"long":-122.26093,"message":"Feeling lonely."},{"undefined":"LatLng(37.87265, -122.26457)","lat":37.87265,"long":-122.26457,"message":"Feeling scared about my future. I've been working towards a path in medicine for over four years, and hearing others around me getting great interviews while I wasn't made me really question my self worth. "},{"undefined":"LatLng(37.86994, -122.25824)","lat":37.86994,"long":-122.25824,"message":"Frustration with cal central "},{"undefined":"LatLng(37.87072, -122.26157)","lat":37.87072,"long":-122.26157,"message":"Stress about getting into Haas and family problems. "},{"undefined":"LatLng(37.87157, -122.24977)","lat":37.87157,"long":-122.24977,"message":"I was in my second semester of freshman year and I've been failing all my classes. That sem was particularly difficult 'cause I had Chem 4B, Math 1B, Physics 8A, R&C5B, and Psy 1. I just turned in my third paper for  Psy 1 a couple minutes late, which meant my score was automatically cut by half. I was guaranteed to get a B (which I did). I felt like my presence at Cal was a mistake b/c people said Psy 1 was easy A. I remember it had just rained and the trail was muddy and slippery, but I decided to climbed to the big C anyways b/c I needed a place to cry alone for hours. I couldn't find the big C, so ended up sitting at the Tightward Hill, crying and staring at the stadium for hours."},{"undefined":"LatLng(37.86583, -122.25857)","lat":37.86583,"long":-122.25857,"message":"I was talking to my sort-of-but-undefined long distance boyfriend on the phone. He hadn't called me in a week and I was completely fried writing my thesis. I worried about where we stood but was too afraid to ask."},{"undefined":"LatLng(37.87343, -122.25604)","lat":37.87343,"long":-122.25604,"message":"At first I couldn't understand the physics lecture. Then my frustration expanded to how I struggle so much in other STEM subjects (despite the fact that I'm a STEM major) and how I didn't believe I had other redeemable traits. I felt stupid for not being able to understand the material, for choosing to do something I'm bad at, and for possibly wasting my entire time at Berkeley. I felt like a waste of space. "},{"undefined":"LatLng(37.87292, -122.26527)","lat":37.87292,"long":-122.26527,"message":"I bombed my 6th final exam and cried in the hallway. I took on 21 units that semester because I felt inadequate and that I was doing \"too little.\""},{"undefined":"LatLng(37.87135, -122.257)","lat":37.87135,"long":-122.257,"message":"Got asked to sight sing a hard passage on the spot in front of the whole class and I choked. I started crying about halfway through "},{"undefined":"LatLng(37.86818, -122.25536)","lat":37.86818,"long":-122.25536,"message":"The loud chatter and laughter from people at Unit 3 for CalSo made my social anxiety kick in. I ended up ditching CalSo even though I paid for it. "},{"undefined":"LatLng(37.87113, -122.26078)","lat":37.87113,"long":-122.26078,"message":"I was studying with my roommate in Dwinelle, and after she left I cried because I realized that I would never be as smart or hardworking as her and (seemingly) all the other students at Cal"},{"undefined":"LatLng(37.86978, -122.25959)","lat":37.86978,"long":-122.25959,"message":"My ex told me that he didn't want to be friends anymore. "},{"undefined":"LatLng(37.87158, -122.25748)","lat":37.87158,"long":-122.25748,"message":"Unhelpful counselor @cogsci department"},{"undefined":"LatLng(37.86687, -122.2584)","lat":37.86687,"long":-122.2584,"message":"Realized my take home midterm was due that night not in 3 days"},{"undefined":"LatLng(37.87084, -122.26298)","lat":37.87084,"long":-122.26298,"message":"Thought I failed my gen chem final... then I took ochem 🙃🙃"},{"undefined":"LatLng(37.8733, -122.25938)","lat":37.8733,"long":-122.25938,"message":"I missed my boyfriend, who had recently dropped out. I just really wished he could've been there with me to enjoy the beautiful day on the Glade."},{"undefined":"LatLng(37.87042, -122.26031)","lat":37.87042,"long":-122.26031,"message":"In my first semester here I got so sick that I had to leave my math discussion in Dwinelle because I was coughing so much. I was completely overwhelmed, felt like my body was failing me and was worried I couldn't take care of my health while living on my own. "},{"undefined":"LatLng(37.87523, -122.25749)","lat":37.87523,"long":-122.25749,"message":"CS wrecked me"},{"undefined":"LatLng(37.8734, -122.25444)","lat":37.8734,"long":-122.25444,"message":"My boyfriend told me he never loved me. He just didn't like seeing me happy with other people."},{"undefined":"LatLng(37.87489, -122.25809)","lat":37.87489,"long":-122.25809,"message":"I was failing a class. I studied and studied and studied, but nothing was sticking. I was three days into dead week and I couldn't take it anymore. I broke down in a classroom and sobbed my heart out. I had never felt so alone in my life."},{"undefined":"LatLng(37.87058, -122.26062)","lat":37.87058,"long":-122.26062,"message":"I was really stressed out because of a project. Then I had a paper stacked on top. My teammates tried to take credit for my work and the paper, though I did most of the work. One even asked me to be a reference for how he was a hard worker and great at coding. I was in the office hours for another class and I broke down in tears. "},{"undefined":"LatLng(37.86998, -122.25723)","lat":37.86998,"long":-122.25723,"message":"walking to class the day after the election "},{"undefined":"LatLng(37.8798, -122.27253)","lat":37.8798,"long":-122.27253,"message":"in the shower, felt that none of my friends really cared about me because no one really remembered my birthday nor cared to check up on me at at all "},{"undefined":"LatLng(37.86839, -122.26038)","lat":37.86839,"long":-122.26038,"message":"Realized I was going to graduate with no future plans or prospects "},{"undefined":"LatLng(37.87545, -122.26056)","lat":37.87545,"long":-122.26056,"message":"Unrequited love "},{"undefined":"LatLng(37.8687, -122.25811)","lat":37.8687,"long":-122.25811,"message":"I had a panic attack during a review session for a final and had to rush out of the room before it was over; I was and crying on the phone to my mom here."},{"undefined":"LatLng(37.86904, -122.25966)","lat":37.86904,"long":-122.25966,"message":"In MLK when I got rejection from HAAS"},{"undefined":"LatLng(37.87401, -122.25998)","lat":37.87401,"long":-122.25998,"message":"failed the first class of my life "},{"undefined":"LatLng(37.87404, -122.257)","lat":37.87404,"long":-122.257,"message":"My best friend was hospitalized for mental health reasons, the hardest lab report of my life was due the next day, I'd been dealing with realizing I'm trans, and I had just gotten news of my grandfather's passing as I was walking to class to give a presentation. "},{"undefined":"LatLng(37.87154, -122.26172)","lat":37.87154,"long":-122.26172,"message":"As I was studying for two midterms @2am-ish, I just had a mental breakdown of how I hated life so much because of Cal.   )':')"},{"undefined":"LatLng(37.8758, -122.25637)","lat":37.8758,"long":-122.25637,"message":"Homesick for the first time in my freshman year. Couldn't deal with anything. I had no friends who I could call my own. Being an international student in this country, I felt like an outsider and nobody really reciprocated any of my efforts to try to reach out and just have... someone there for me."},{"undefined":"LatLng(37.86906, -122.25238)","lat":37.86906,"long":-122.25238,"message":"existential dread & loneliness"},{"undefined":"LatLng(37.8742, -122.25813)","lat":37.8742,"long":-122.25813,"message":"I got dumped during my 2nd week of college. I cried in the outdoor patio outside of the engineering buildings. I previously loved that spot, and after this moment, never stepped foot on that patio again."},{"undefined":"LatLng(37.87252, -122.2611)","lat":37.87252,"long":-122.2611,"message":"I was studying for an ochem midterm on moffitt 4th floor when I realized just how much was on the test. After writing out everything I needed to know, I made a lil’ white board fort around me, put my head down, and cried for a while. "},{"undefined":"LatLng(37.86908, -122.24992)","lat":37.86908,"long":-122.24992,"message":"Started crying on the steps of what is now Delta Sigma because I got dumped."},{"undefined":"LatLng(37.85656, -122.26339)","lat":37.86909,"long":-122.25969,"message":"I cry in MLK pretty frequently, especially on the second floor.  I like it a lot because you can be sitting at one of the tables and cry silently without people asking if you're okay--you can just cry without feeling the pressure of people feeling uncomfortable, I think?   It's a place where people really respect the precept of mind your own business, and I think it's better to cry in a comfy MLK chair after a midterm gone awry or class rejection rather than a bench outside."},{"undefined":"LatLng(37.86688, -122.25794)","lat":37.86688,"long":-122.25794,"message":"After sitting through an unproductive mediation session with a hostile roommate and the residential director"},{"undefined":"LatLng(37.86764, -122.26896)","lat":37.86764,"long":-122.26896,"message":"Reading a Facebook post about first generation students, reminded me of the sacrifices my parents made. Cried further because of a stressful week of midterms and just being mediocre. I’m scared of just being average. I don’t understand why as a junior I still haven’t gotten accustomed to UCB. "},{"undefined":"LatLng(37.86994, -122.26114)","lat":37.86994,"long":-122.26114,"message":"I found out my father passed away during my 8 AM Spanish class. My mom called me three times before I finally stepped out to picked up stuff. I left class without saying a word. "},{"undefined":"LatLng(37.86617, -122.24658)","lat":37.86617,"long":-122.24658,"message":"I wasn't doing anywhere near as well in school as I had too, and all of my roommates and floor mates were talking about moving into apartments. I didn't have to worry about that, because my family didn't have the money for it and I was going to commute from home. Also, my boyfriend and I started having a lot of problems around this time. I felt alone because my entire support group was inaccessible and everything seemed so difficult. Things haven't improved since then, so I've been crying a lot more than I ever used to. But I still remember the spot where I started crying and never really stopped."},{"undefined":"LatLng(37.87214, -122.26037)","lat":37.87214,"long":-122.26037,"message":"general fears that everyone hates me"},{"undefined":"LatLng(37.87148, -122.26466)","lat":37.87148,"long":-122.26466,"message":"I was calling my best friend who is across the country and I cried because I missed him so much. "},{"undefined":"LatLng(37.87136, -122.26214)","lat":37.87136,"long":-122.26214,"message":"After my grandfather's funeral and a multitude of midterms, I had to see an academic advisor to approve my class schedule. He \"advised\" me to look for a career path other than medicine, as if I didn't doubt myself enough. "},{"undefined":"LatLng(37.87048, -122.25363)","lat":37.87048,"long":-122.25363,"message":"Family problems"},{"undefined":"LatLng(37.86874, -122.26041)","lat":37.86874,"long":-122.26041,"message":"Learned a beloved teacher from high school passed away"},{"undefined":"LatLng(37.87189, -122.26231)","lat":37.87189,"long":-122.26231,"message":"Cried right after walking out of CS61B midterm 2 (I knew I failed)"},{"undefined":"LatLng(37.87062, -122.26058)","lat":37.87062,"long":-122.26058,"message":"Went to the inside plaza in Dwinelle and called my mom and started bawling bc of how shitty pledging was"},{"undefined":"LatLng(37.86667, -122.25958)","lat":37.86667,"long":-122.25958,"message":"Broke down when I learned someone I liked for a very long time is in a relationship"},{"undefined":"LatLng(37.87263, -122.26416)","lat":37.87263,"long":-122.26416,"message":"Life sucks"},{"undefined":"LatLng(37.87031, -122.26048)","lat":37.87031,"long":-122.26048,"message":"Sleep-deprived and stressed."},{"undefined":"LatLng(37.87374, -122.25929)","lat":37.87374,"long":-122.25929,"message":"Realized I wasn't as smart as I thought I was."},{"undefined":"LatLng(37.86991, -122.25517)","lat":37.86991,"long":-122.25517,"message":"I was sick and had an audition and it was raining so i just cried."},{"undefined":"LatLng(37.87707, -122.26045)","lat":37.87707,"long":-122.26045,"message":"Walking out of my apartment on the last day of our lease. It had been my toughest and best year at Cal. Some of my favorite memories had happened there, and I considered it home. "},{"undefined":"LatLng(37.87538, -122.25515)","lat":37.87538,"long":-122.25515,"message":"School,work,internship,social life, family commitments all came crashing down at one time and it was just too much so I broke down and cried."},{"undefined":"LatLng(37.87168, -122.25681)","lat":37.87168,"long":-122.25681,"message":"It was my birthday freshman year, which happened to fall on my most stressful day of the semester. I was also really lonely, and missed home. It all overwhelmed me, and I cried in that knotty wizened tree near faculty glade. "},{"undefined":"LatLng(37.8696, -122.25343)","lat":37.8696,"long":-122.25343,"message":"I was trying to explain to a friend/someone I work with that I couldn’t do parts of my job because of my anxiety. I had never talked about my anxiety with more than one person before, ended up having an anxiety attack and ran to cry in the bathroom. "},{"undefined":"LatLng(37.87015, -122.25855)","lat":37.87015,"long":-122.25855,"message":"I saw Milo"},{"undefined":"LatLng(37.87028, -122.25655)","lat":37.87028,"long":-122.25655,"message":"Questioning my life as an architecture major who is always sleep deprived from pulling all nighters and never gets to have fun"},{"undefined":"LatLng(37.87296, -122.26689)","lat":37.87296,"long":-122.26689,"message":"I woke up one night, realizing I'd missed a date earlier that day. My phone was overflowing with texts from her. I prayed she wouldn't break up with me. She did. She told me she's leaving me for another guy. I cried really badly that night."},{"undefined":"LatLng(37.86405, -122.25595)","lat":37.86405,"long":-122.25595,"message":"I lost my virginity one night at a party. I was feeling proud of myself when I realized I hadn't used a condom. Thankfully, everything turned out alright, but I didn't know for a couple weeks. I cried almost every night during those weeks."},{"undefined":"LatLng(37.87173, -122.26114)","lat":37.87173,"long":-122.26114,"message":"I was studying late in a library with some friends during my first semester of freshman year. My mom called me and I went outside to talk to her. Suddenly, I burst into tears from the overwhelming stress of midterms and the heavy weight on my chest of having to decide what I wanted to do with my life. I felt so directionless, like I was guessing at my interests and major and potentially guessing wrong. I finished up the conversation, cleaned up my face, and went back to the library to study with my friends."},{"undefined":"LatLng(37.86834, -122.26282)","lat":37.86834,"long":-122.26282,"message":"I walked out of my math 54 final exam at the end of my first semester of freshman year, having left half the pages blank because I just didn't know how to solve the problems. I'd never felt so helpless and stupid in my life. I called my mom and sobbed to her, making plans to drop out of Berkeley due to an abysmal GPA, trying to convince myself that I could transfer to an easier school and still be successful. I knew I had failed the exam. In a way, I wasn't wrong - I got a 52%, but the average was 48%, so I still got a B+ in the class. That was, for me, an introduction to what studying at Berkeley was like. What kind of professor would write an exam that the majority of their students get an F in? A Berkeley professor. "},{"undefined":"LatLng(37.87106, -122.26204)","lat":37.87106,"long":-122.26204,"message":"I saw my ex-boyfriend. "},{"undefined":"LatLng(37.8739, -122.25593)","lat":37.8739,"long":-122.25593,"message":"Horrible first day of lab."},{"undefined":"LatLng(37.86941, -122.25578)","lat":37.86941,"long":-122.25578,"message":"My Dad called to tell me my Papaw passed away."},{"undefined":"LatLng(37.86887, -122.26019)","lat":37.86887,"long":-122.26019,"message":"Found out a friend from high school overdosed and passed away"},{"undefined":"LatLng(37.86967, -122.25337)","lat":37.86967,"long":-122.25337,"message":"I had just finished a class discussing the crime of rape. The entire class I remembered how his hands felt grabbing my body.  I ran out to get air. It was such a beautiful day. I started to cry... for myself? for the victims? I think it was because I had lost hope that things would get better for our world. "},{"undefined":"LatLng(37.87153, -122.27079)","lat":37.87153,"long":-122.27079,"message":"Friend attempted suicide in a different town and I called the police to go intervene and stop him before it was too late. "},{"undefined":"LatLng(37.86978, -122.25987)","lat":37.86978,"long":-122.25987,"message":"Learned in text message that the younger brother of a close friend from my hometown had taken their own life. "},{"undefined":"LatLng(37.8707, -122.25475)","lat":37.8707,"long":-122.25475,"message":"I cried my eyes out here for many reasons throughout my time in this institution. The first time, I was scared and felt like a total disaster when I failed my first choice major. The most recent event, I broke down because I am still recovering from a sexual harassment... anyways there's a beautiful view of campus from Room 1000!"},{"undefined":"LatLng(37.87361, -122.26111)","lat":37.87361,"long":-122.26111,"message":"I've endured nearly four years of abuse and harassment from an ex-partner. This situation has recently drastically escalated. I'm dealing with the courts, but they have historically been inadequate in their responses and protections for me and my family. I've spent every day crying, for the past few weeks. I'm trying my best to be present at home, in school, work, internships, and elsewhere... But it's been really difficult. I just want to go home and cry and then sleep for a month."},{"undefined":"LatLng(37.87186, -122.26899)","lat":37.87186,"long":-122.26899,"message":"The most emotional moment at Cal for me was when I came to terms with myself that I had an eating disorder and called the UC Berkeley help line. I was curled up in a little ball of pain and shame shaking but getting help. "},{"undefined":"LatLng(37.87402, -122.25929)","lat":37.87402,"long":-122.25929,"message":"I recently left behind an unhealthy relationship after many years. Sometimes it becomes overwhelming and distracting, recently I cried about it while in a class. It's frustrating when a person who took so much else away from you also takes away your capacity to focus and be a good student. I think a lot of students struggle with this. I'm learning that accepting that external stress will bubble up at unfortunate times (like section lol) is fine and that it's important not to give yourself a hard time.  Everyone is just doing the best they can <3 "},{"undefined":"LatLng(37.87038, -122.25955)","lat":37.87038,"long":-122.25955,"message":"I started dating someone for the first time in 3 years and it brought back a lot of terrible memories from my ex boyfriend and then all the \"me too\" stuff on Facebook triggered me and I couldn't keep it in anymore while walking between classes"},{"undefined":"LatLng(37.87296, -122.26075)","lat":37.87296,"long":-122.26075,"message":"I had a mental breakdown after pretty much failing 4 midterms in a row so I went and cried on the fourth floor of Moffitt inside the restrooms because it's so private there. I even wrote a suicide letter for my loved ones the night before in case I did anything impulsive or stupid. "},{"undefined":"LatLng(37.87045, -122.25909)","lat":37.87045,"long":-122.25909,"message":"Boyfriend told me I was things that were too psychologically painful to bear. I believed his every word about me and would break down in tears at every glancing thought of it. I hated myself."},{"undefined":"LatLng(37.86993, -122.25514)","lat":37.86993,"long":-122.25514,"message":"My friend was sexually assaulted while studying abroad. I couldn't do anything about it."},{"undefined":"LatLng(37.87319, -122.25838)","lat":37.87319,"long":-122.25838,"message":"remembered how the tour guide on my first trip around campus had joked evans was the best place to commit suicide. sat in a bathroom on the eighth floor crying until i didn't want to die any longer."},{"undefined":"LatLng(37.87426, -122.25796)","lat":37.87426,"long":-122.25796,"message":"Been depressed for as long as I can remember and its not getting any better. All my friends and family think my life is 'perfect' but I just want to disappear. Regardless of what I accomplish I just can't seem to be happy :/"},{"undefined":"LatLng(37.87028, -122.26438)","lat":37.87028,"long":-122.26438,"message":"Freshman year my GSI got into a biking accident so Dr. Pedersen covered our 3A lab for the week. He went around looking at everyone's prelabs to see if they were completed. This was my first interaction with a professor. He comes around to look at mine and proceeds to tell me it wasn't done properly because I was missing 3 structures in my table of elements. He tells me I can't do the lab and I'm standing there in shock, he goes around to check everyone's prelabs and looks back at me and says \"what are you still doing here?\" I run out of lab and go straight to the Hildebrand bathroom to cry while texting my friend about what happened. I cried for a couple hours and was traumatized by the experience. "},{"undefined":"LatLng(37.87412, -122.25888)","lat":37.87412,"long":-122.25888,"message":"I rolled too hard at Odesza and was mentally unable to study for my midterm that week. "},{"undefined":"LatLng(37.86764, -122.26552)","lat":37.86764,"long":-122.26552,"message":"I was supposed to have hung out with my then boyfriend, and when he flaked again, I'd had it for the last time. I asked to him to drop by, that I just wanted to see him for a moment. My four housemates were blissfully unaware and in their bedrooms, and as my ex and I sat across from each other in the sunroom, we cried and hugged for the last time."},{"undefined":"LatLng(37.8759, -122.25611)","lat":37.8759,"long":-122.25611,"message":"Common area in Foothill. The site of so many relationship-related tears - of stress because I wasn't sure if he liked me, despair when I was convinced he would never like me, and happiness when he told me he loved me :)"},{"undefined":"LatLng(37.87357, -122.25801)","lat":37.87357,"long":-122.25801,"message":"Second year, basement of Evans Hall. Overwhelmed with schoolwork, my job, societal/familial expectations of me, personal pressure, major depressive episode #1, bipolar disorder, self-hatred, relationship doubts, and lack of time to do anything for myself. I've since graduated and survived. It gets better. Much better :)"},{"undefined":"LatLng(37.8676, -122.25492)","lat":37.8676,"long":-122.25492,"message":"I had gone home for the weekend and came out to my parents. They didn't take it very well at all. While I was at home, I was pretty numb, but coming back to campus it really came crashing down with how much stress my parents' disapproval added to my shoulders. I ugly cried into my partners arms for an hour."},{"undefined":"LatLng(37.8691, -122.25461)","lat":37.8691,"long":-122.25461,"message":"My lecturer for my summer course lost pages of my final exam and gave me a D. She wouldn't believe when I told her that and she wouldn't let me access my final exam. I was really confused so I called my dad and cried. People from Strada were staring at me when I was walking by.  "},{"undefined":"LatLng(37.87001, -122.25904)","lat":37.87001,"long":-122.25904,"message":"I was wrongly charged of $2,000 from Alameda Social Services, and I was dealing with annoying financial aid reimbursements so I was in line waiting hours for my appointment with a financial aid worker. Just when I was next on line, my case worker called me after 2 long months and said they won my case and will relieve my $2000 charge. I was choked on words and started crying on the staircases near Barrows. Tears of happiness and relief. :')"},{"undefined":"LatLng(37.86923, -122.25968)","lat":37.86923,"long":-122.25968,"message":"some jerk sexually assaulted me walking down telegraph to go to class. He looked at me, laughed, and walked away. At first, I was just in shock and I felt really numb. But waiting for the elevator, i couldn't hold it in anymore and I started crying. "},{"undefined":"LatLng(37.87082, -122.25698)","lat":37.87082,"long":-122.25698,"message":"I got a B- on a paper that I was expecting to do really well on. I was leaving my lecture in Mccone and went to the restroom in East Asian to cry. "},{"undefined":"LatLng(37.86198, -122.25165)","lat":37.86198,"long":-122.25165,"message":"Cut some onions."},{"undefined":"LatLng(37.86378, -122.24805)","lat":37.86378,"long":-122.24805,"message":"Freshmen year during dead week, I was trying to do a math practice set and I was stuck on a problem for a really long time. I was alone in the room and I felt like I should have studied more and asked for help beforehand. I messaged my friend for help but by then I started panicking. Later I started doubting my self worth and why I couldn't even solve a problem meant for a 1st year and had an emotional breakdown . "},{"undefined":"LatLng(37.87238, -122.26414)","lat":37.87238,"long":-122.26414,"message":"Super sleep deprived, and I got a simple iClicker question wrong. Friend next to me starting saying \"Well yeah of course, dah dah dah\" and I snapped and told her I KNOW GOSH. Later after class, I felt bad and started tearing up from all the stress and desperate need for sleep."},{"undefined":"LatLng(37.8694, -122.25981)","lat":37.8694,"long":-122.25981,"message":"Kept asking for help and friend told me that I've went over this a million times and didn't understand why it doesn't go through my head. I sank slowly into my sadness and said I'd try to work on it alone. Put my head down for a nap and starting crying softly because I felt worthless.  No one ever found out. "},{"undefined":"LatLng(37.8693, -122.25972)","lat":37.8693,"long":-122.25972,"message":"Excused myself from my study group after everyone understood a concept except me. Went to the staircase and cried before coming back pretending I went to the bathroom. "},{"undefined":"LatLng(37.86916, -122.2614)","lat":37.86916,"long":-122.2614,"message":"Was so so physically tired. Pulled an all night and had a week of 5 or less hours of sleep.  Didn't cry because I was tired of life or anything, but because I was desperate for sleep and  extremely exhausted. Unfortunately I still had a long day. "},{"undefined":"LatLng(37.8696, -122.25187)","lat":37.8696,"long":-122.25187,"message":"First year in law school, I ran as fast as I can from the law school to I-House. But I was not fast enough to make it to my room without crying in public. I was half-screaming, half-crying. "},{"undefined":"LatLng(37.87138, -122.26236)","lat":37.87138,"long":-122.26236,"message":"Saw that dude Gordon Hayward broke his ankle was crying tears of joy lmao"},{"undefined":"LatLng(37.86737, -122.25436)","lat":37.86737,"long":-122.25436,"message":"Finding internship, 3 midterms, stress"},{"undefined":"LatLng(37.87533, -122.25925)","lat":37.87533,"long":-122.25925,"message":"I had cried because I had gotten rejected from my dream company for an internship after interviewing with them two weeks prior and I was also failing my math class. To make things worse, I also had a midterm that night and I just felt the weight of the world against me. I just felt like I needed to let the stress out of my system. So I cried."},{"undefined":"LatLng(37.87557, -122.25923)","lat":37.87557,"long":-122.25923,"message":"Started crying because I was stressed my group project wouldn't be finished and was also dealing with family in the hospital but hadn't told my group about it."},{"undefined":"LatLng(37.87503, -122.25948)","lat":37.87503,"long":-122.25948,"message":"I cried my eyes out over a particularly ruthless problem set for ERG 102 in the women's bathroom in North Gate Hall. Shout out to the angel in the stall next to me who whispered, \"I hope your day gets better!\""},{"undefined":"LatLng(37.87147, -122.26434)","lat":37.87147,"long":-122.26434,"message":"Leaving my sorority house for the last time, knowing that the women of the chapter no longer supported my academic vision of pursuing a Ph.D. after Cal"},{"undefined":"LatLng(37.86455, -122.25979)","lat":37.86455,"long":-122.25979,"message":"During my first year as a transfer I took a logic quiz that I studied real hard for. The quizzes kept varying from above difficulty to not enough time to finish. I didn’t even get to finish mine with the time given and I knew I bombed it before I got out. As I was walking out of the Valley Life Science Building I cried in that hallway... there were students in that hallway. I will never forget that. "},{"undefined":"LatLng(37.86866, -122.2612)","lat":37.86866,"long":-122.2612,"message":"I drove directly to class from the hospital where I watched my brother's 25 year old girlfriend die from birth control complications. I couldn't miss any more class after spending five days in the ICU or my enrollment at Cal would be terminated.  My teacher didn't understand the situation and said \"maybe she'll pull through.\" I said \"She died. She's dead.\" "},{"undefined":"LatLng(37.87148, -122.26466)","lat":37.87148,"long":-122.26466,"message":"In the moffit bathroom. I've never felt so below average or inadequate until I came here. "},{"undefined":"LatLng(37.87016, -122.26217)","lat":37.87016,"long":-122.26217,"message":"found out the person i loved didn’t love me back the way i’d hoped "},{"undefined":"LatLng(37.87007, -122.25805)","lat":37.87007,"long":-122.25805,"message":"I had a panic attack in class and the professor mocked me for it in front of everyone, so I started crying, which only made it worse. "},{"undefined":"LatLng(37.87241, -122.26244)","lat":37.87241,"long":-122.26244,"message":"It was post-C midterm and I just started running away from Dwinelle until I found a spot with more trees than people"},{"undefined":"LatLng(37.86979, -122.26061)","lat":37.86979,"long":-122.26061,"message":"Choral Rehearsal Hall in the basement of Cesar Chavez Student Center. Theatre is very stressful. "},{"undefined":"LatLng(37.87248, -122.25401)","lat":37.87248,"long":-122.25401,"message":"On the phone with my boyfriend and thought he didn't love me anymore."},{"undefined":"LatLng(37.87147, -122.26037)","lat":37.87147,"long":-122.26037,"message":"intense depression about the problems in my life right now (physical health, academic welfare, job prospects, relationship troubles)"},{"undefined":"LatLng(37.87006, -122.25496)","lat":37.87006,"long":-122.25496,"message":"I was walking to class while talking to my mom on the phone. Recently I just don't know what I want to do with my life and as a senior that is really overwhelming. I just don't know what my next steps are. My cousin died in February from a drug overdose and my boyfriend and I broke up the beginning of summer.  I feel like a lot of people don't understand what I'm going through. "},{"undefined":"LatLng(37.87072, -122.25125)","lat":37.87072,"long":-122.25125,"message":"I can't explain why, but I'm pretty sure that I'll end up homeless after I finish my PhD"},{"undefined":"LatLng(37.85734, -122.25831)","lat":37.85734,"long":-122.25831,"message":"I was pulling an all nighter with my friends for a CS exam, and I couldn't walk homeanyways  since I sprained my ankle really badly during a break up. I cried in a nap pod for like 45 minutes when I realized my ex who broke up with me the week before blocked me after I posted pictures from a party"},{"undefined":"LatLng(37.87208, -122.26361)","lat":37.87208,"long":-122.26361,"message":"Because I didn't get into Cal."},{"undefined":"LatLng(37.86763, -122.25454)","lat":37.86763,"long":-122.25454,"message":"academic stress"},{"undefined":"LatLng(37.86618, -122.25622)","lat":37.86618,"long":-122.25622,"message":"I cried over the fact that I hadn't cried in years.... I felt like an emotionless brick incapable of feeling sad, lonely, stressed and I kept forcing myself to be happy only. Needless to say, crying over not crying was the best feeling in the world."},{"undefined":"LatLng(37.87556, -122.25861)","lat":37.87556,"long":-122.25861,"message":"At the end of my sophomore year I bombed the CS70 final. It was my last pre req for the Computer Science major and I thought I was going to miss the GPA cutoff (I ended up barely clearing it). I went to Professor Sahai's office to go over the final with him. He looked me in eyes and told me he didn't think I belonged in Berkeley CS and that I should transfer schools. I just lost it and started bawling.  I'm sure it was quite the site for him to see this straight white frat boy lose his composure, but the years of stress had led to this. That moment was the slap in the face that motivated me to prove I deserved to be here. I finished the major and graduated."},{"undefined":"LatLng(37.8732, -122.25503)","lat":37.8732,"long":-122.25503,"message":"My high school boyfriend moved across the country for college and we broke up.  Cried here after I got back from dropping him off at the airport; it was our very last moment together."},{"undefined":"LatLng(37.8757, -122.25761)","lat":37.8757,"long":-122.25761,"message":"r e l i e f  after pulling two all nighters in a row at the end of a two-week period of sleeping <3 hours per night (3 projects and a research paper fell over the same 3 weeks, and the first of those weeks was taken up by midterms. don't take 20 units kids), and frustration at getting a c- on a midterm for which i tutored other people because i ran out of time due to fixing a persnickety and insidious algebraic error"},{"undefined":"LatLng(37.86774, -122.2553)","lat":37.86774,"long":-122.2553,"message":"Had an anxiety attack during my math quiz. It was an easier question that I had studied but for some reason, I couldn't get myself to read the question. The more people began to turn in their quizzes, the more I started to shake. It was the first time that my mental health has interfered with my academic life and I started freaking out. "},{"undefined":"LatLng(37.86869, -122.25065)","lat":37.86869,"long":-122.25065,"message":"Overwhelmed with having way too many things to do, so little time to do it, and a deep need to do it all perfectly "},{"undefined":"LatLng(37.87529, -122.26174)","lat":37.87529,"long":-122.26174,"message":"midterms"},{"undefined":"LatLng(37.87603, -122.26033)","lat":37.87603,"long":-122.26033,"message":"The entire walk home from my Chem 3A midterm."},{"undefined":"LatLng(37.8712, -122.26047)","lat":37.8712,"long":-122.26047,"message":"i remember after my first cs61a final i went to a bench and cried"},{"undefined":"LatLng(37.86889, -122.26002)","lat":37.86889,"long":-122.26002,"message":"I had a paper, midterm and two problem sets due within 24 hours of each other. In all my anxiety, I forgot about a third problem set that was due in 5 mins. In that moment, I felt so helpless. I burst out crying in public and thought my chances for grad school were done right there."},{"undefined":"LatLng(37.86684, -122.25513)","lat":37.86684,"long":-122.25513,"message":"My two sisters, my mom, and my dad drove up with me from Socal to move me into Unit 2 as everyone was excited as I was the first to go to college in the family. The only person missing was my sister who was a year younger than me and whom I was the closest to. She had just passed away a week and a half ago during her liver transplant surgery and it was a difficult time for all of us specially me. This was my first time away from my family, friends, support network, and most importantly, my sister. I was walking my dad back to their car  while the rest of my family waited for him to head back home. Just before he left, he told me everyone was proud, and to do it for my sister. He broke into tears (the first time I had ever seen him cry) as he hugged me good bye. I held my composure until I saw them drive away. I dropped to my knees and sobbed uncontrollably for a few minutes before I embarked on my crazy journey.  This was the first of many break downs and would prove to be the most difficult time of my life. Two years later I cried one last time in Memorial Stadium. After walking on the graduation stage, I saw my parents, hugged them, and broke down for a final time..."},{"undefined":"LatLng(37.86247, -122.2641)","lat":37.86247,"long":-122.2641,"message":"self loathing"},{"undefined":"LatLng(37.86737, -122.25779)","lat":37.86737,"long":-122.25779,"message":"Sushi order was forgotten"},{"undefined":"LatLng(37.8671, -122.25994)","lat":37.8671,"long":-122.25994,"message":"I cried in my dorm room a few times during  the second semester of my sophomore year. I felt lost and I hated it at Cal. I didn't know what I wanted to do with my life. As a result, I became depressed, and I spent the majority of my days in my bed and rarely went to class. However, I was taking three technical classes and so my grades suffered. The resulting stress only worsened my mental state. On top of this, my family was having issues too. My mother was extremely ill (She ended up passing away this summer). At the same time, my sister refused to contact either of my parents. So, yeah, it was a lot... "},{"undefined":"LatLng(37.87346, -122.25689)","lat":37.87346,"long":-122.25689,"message":"I realized I didn't love learning anymore. I used to get so excited about my physics and history classes in high school. But now I just see material as stuff my profs can use to fuck me over with in exams. "},{"undefined":"LatLng(37.86804, -122.25682)","lat":37.86804,"long":-122.25682,"message":"Was hit with quantum mechanics in the beginning of general Chemistry 4A freshman year. I’m still mentally, emotionally, and physically unstable. (Pimentel Hall)"},{"undefined":"LatLng(37.86969, -122.25478)","lat":37.86969,"long":-122.25478,"message":"i thought i did terribly on a quiz i studied so much for. i was mentally drained and didn't want to go back to my unwelcoming complex. i wanted comfort and felt overwhelmed. "},{"undefined":"LatLng(37.87123, -122.25951)","lat":37.87123,"long":-122.25951,"message":"I cried here one summer afternoon because I was extremely stressed about failing research and bad grades and not getting into grad school."},{"undefined":"LatLng(37.8718, -122.26013)","lat":37.8718,"long":-122.26013,"message":"I rejected someone's confession, then they came back a few months later and told me I was directly responsible for their crippling depression.  I couldn't handle it and I cried on my way home."},{"undefined":"LatLng(37.86585, -122.25443)","lat":37.86585,"long":-122.25443,"message":"I cried a lot the year I lived in the dorms. Sometimes because of my long-distance relationship, sometimes because of general stress and anxiety, sometimes out of guilt."},{"undefined":"LatLng(37.87074, -122.25492)","lat":37.87074,"long":-122.25492,"message":"Studio all-nighters, sometimes several in a row. Need I say more?"},{"undefined":"LatLng(37.87297, -122.26011)","lat":37.87297,"long":-122.26011,"message":"got an F on a midterm, went to some random small path of trees off of memorial glade and called my mom and cried"},{"undefined":"LatLng(37.86762, -122.26431)","lat":37.86762,"long":-122.26431,"message":"I had my fingertip cut off during a skateboarding accident first month into college. That's when I came closest to crying, at tang."},{"undefined":"LatLng(37.8666, -122.25957)","lat":37.8666,"long":-122.25957,"message":"finals week and friends being mad at me :("},{"undefined":"LatLng(37.86953, -122.26401)","lat":37.86953,"long":-122.26401,"message":"sad alone and dejected"},{"undefined":"LatLng(37.8735, -122.25878)","lat":37.8735,"long":-122.25878,"message":"I cried in the Hearst concert hall from stress. I didn't feel prepared for my first semester, knew I was severely ill-prepared for Physics 7A. I blamed myself for not studying more, blamed my high school for not having the budget for AP Physics, blamed the fact that growing up poor maybe did affect how I did in college. "},{"undefined":"LatLng(37.87136, -122.25981)","lat":37.87136,"long":-122.25981,"message":"Burst out crying when I learned my advisor had terminal cancer. I couldn't stop crying all day, even though I had meetings all over campus -- cried in front of 3 other professors, bursting into tears midway in the conversation and leaving. Literally never talked about it again but I had a little bit of a reputation as being 'unstable' for about a year."},{"undefined":"LatLng(37.87571, -122.25937)","lat":37.87571,"long":-122.25937,"message":"The one time I had test anxiety was in Etch. Had to calm myself down and keep myself from crying all the way right in the middle of the Mech E. computer lab."},{"undefined":"LatLng(37.87135, -122.2681)","lat":37.87135,"long":-122.2681,"message":"I was on my way home from an out-of-town job interview for a job that I knew I didn't get, but more importantly had just realized I didn't want. I felt like I had no idea what I wanted to do after I graduated because I didn't like anything I had done so far and nothing sounded even remotely exciting, not to mention that even if I did figure out what I wanted to do, who would even hire me? I felt just really overwhelmed and lost with no direction so I cried in an uberpool and hoped no one really noticed me."},{"undefined":"LatLng(37.8674, -122.26325)","lat":37.8674,"long":-122.26325,"message":"feeling incredibly alone and distant from the people I used to call my closest friends here"},{"undefined":"LatLng(37.86916, -122.25968)","lat":37.86916,"long":-122.25968,"message":"In my freshman year I was struggling with eating disorder and a general sadness that comes when you're separated from your long-time friends. I felt like I couldn't confide in anyone that I had met, given that we only knew each other for a few months, so I was so lonely. "},{"undefined":"LatLng(37.87008, -122.25525)","lat":37.87008,"long":-122.25525,"message":"I fought with the other leaders of my student organization over ideological and procedural disagreements and gradually came to understand that they wanted me out. I got through our conversation, but barely. Had to find a hallway in Hearst Gym to cry my fucking eyes out. Another friend found me there and I wanted to die of shame. "},{"undefined":"LatLng(37.86577, -122.25423)","lat":37.86577,"long":-122.25423,"message":"I had and still am dealing with depression and self-harm. It was late that night and I was walking home alone because all my friends had crashed early. My phone died on me that night so I couldn't get a ride home. I walked home and I was  raped. The scrapes, bruises, and scars are still there and I'll never forget it. I broke down thinking about it and cried, hoping for someone to help."},{"undefined":"LatLng(37.87556, -122.25869)","lat":37.87556,"long":-122.25869,"message":"My parents got divorced a year and a half ago because my father had been cheating on my mother for my whole life, and my mother finally couldn't forgive him any more. He was in town for a meeting. I spoke to him in person for the first time in months. And he was still as selfish as ever. He still dared to make empty promises.  He still thought he was in the right. Afterwards, I hid in the restroom and cried for the loss of the family I thought I had."},{"undefined":"LatLng(37.86713, -122.26083)","lat":37.86713,"long":-122.26083,"message":"I spent my senior year depressed and my long distance boyfriend was at an equally shitty juncture of his life. We broke up over and over and finally we said we were done over spring break. He told me we could still be friends and begged me to stay in touch. I called him a week later when my dog died and he asked what I wanted and why I was calling. He killed every last bit of hope."},{"undefined":"LatLng(37.86726, -122.2644)","lat":37.86726,"long":-122.2644,"message":"I cried because I got a bad midterm grade"},{"undefined":"LatLng(37.87288, -122.26225)","lat":37.87288,"long":-122.26225,"message":"During my sophomore year a professor and I had a customary meeting about my direction regarding the final assignment. Feeling like I had finally found clarity  — I went to the professor with my idea. He did not agree with my idea and chose to belittle me and disregard my agency. I will always remember him telling me \"you clearly lack any form of comprehensive direction, I'm going to have to tell you how it is so sit here and listen.\" He continued to mansplain to me as I held back tears, I sat on the bench outside and cried. I liked that the bench was situated in such a way that I was the only one on the hill, everyone else below.  "},{"undefined":"LatLng(37.86939, -122.2598)","lat":37.86939,"long":-122.2598,"message":"Spring semester of my freshman year I got into a fight with the person I was dating at the time. I went to the steps leading down to Lower Sproul, found a bench to lie down on, and started ugly crying. A few minutes later, while I was still on the phone with my partner, a woman with a kind face approached me and handed me a little sheet of paper. I'm not exaggerating when I say that this was my ugliest cry of all time, like my nose was running, my face was covered in tears, the whole nine yards. I assumed that it was a tissue and i ripped a piece off and blew my nose into it. It was only when the woman looked horrified that I looked down and realized that it was a flyer and that she was trying to invite me to a gathering for her Bible study group. I felt terrible and tried to make an excuse but the situation was funny enough that I finally stopped crying. Months later I passed by the same place again and the same woman was there. She recognized me and tried to invite me to her Bible study group again."},{"undefined":"LatLng(37.87292, -122.25561)","lat":37.87292,"long":-122.25561,"message":"My grandfather died, someone who abused me in the past tried to get in touch with me again, and my depressive disorder was skyrocketing.  I was so out of it that I mixed up a date and missed a midterm.  Broke down sobbing as soon as I realized."},{"undefined":"LatLng(37.86562, -122.25361)","lat":37.86562,"long":-122.25361,"message":"in my bed, due to an existential crisis and crippling loneliness "},{"undefined":"LatLng(37.87519, -122.2606)","lat":37.87519,"long":-122.2606,"message":"Being a Daily Cal news editor is stressful "},{"undefined":"LatLng(37.87334, -122.25773)","lat":37.87334,"long":-122.25773,"message":"Had to withdraw my semester for mental health reasons"},{"undefined":"LatLng(37.87383, -122.25663)","lat":37.87383,"long":-122.25663,"message":"My boss yells at me all the time, and he was being really mean on a day where I had a paper due and a midterm, and had been up since 5 am"},{"undefined":"LatLng(37.86669, -122.25401)","lat":37.86669,"long":-122.25401,"message":"it was a rough game day and i had just finished a hard two weeks of midterms and such. called my best friend which made everything better."},{"undefined":"LatLng(37.86777, -122.26333)","lat":37.86777,"long":-122.26333,"message":"I felt homesick and lonely and just generally incompetent in comparison to everyone else, socially and academically. "},{"undefined":"LatLng(37.86909, -122.26085)","lat":37.86909,"long":-122.26085,"message":"Broke down in front of my acting instructor as I explained why I wasn't doing my best in her class. It was the worst month of my college career and was severely depressed, finding it hard to get out of bed, let alone rehearse.  She was kind but I found over the course of that month that Cal is relatively unforgiving and flippant about mental illness. It pushed me to take a year off from school. I did, am now at a different college."},{"undefined":"LatLng(37.86596, -122.25202)","lat":37.86596,"long":-122.25202,"message":"After finding out I had a UTI, continuing my disagreement with my parents, beginning my three-midterm week, my significant other brought me sunflowers from San Francisco."},{"undefined":"LatLng(37.87504, -122.26017)","lat":37.87504,"long":-122.26017,"message":"I’ve cried at the journalism school because I feel like I’m the least qualified journalist ever. "},{"undefined":"LatLng(37.87596, -122.2579)","lat":37.87596,"long":-122.2579,"message":"learned that I could be deeply triggered by a reading assigned for a class; came to terms with the fact that I had been raped."},{"undefined":"LatLng(37.87547, -122.25546)","lat":37.87547,"long":-122.25546,"message":"Turned in my last paper after my last midterm freshman year, and I realised that I would have to go through three more years of sleep deprivation, general anxiety, stress, and feeling inadequate all the time."},{"undefined":"LatLng(37.86855, -122.25303)","lat":37.86855,"long":-122.25303,"message":"Guy I was with abandoned me at a frat party to dance with other girls. I ran out into the street, drunk and alone, and publicly weeped on the streets."},{"undefined":"LatLng(37.87294, -122.25313)","lat":37.87294,"long":-122.25313,"message":"The boy I loved kissed me (finally!), but after he left my room I broke down crying because I genuinely believe I'd be bad for him.  He's brilliant and I'm a mess. I told him we'd never work and I haven't heard from him since.  "},{"undefined":"LatLng(37.87147, -122.26434)","lat":37.87147,"long":-122.26434,"message":"cried to my friends because my hookup and I ended things"},{"undefined":"LatLng(37.8688, -122.26822)","lat":37.8688,"long":-122.26822,"message":"Lol, I cry at shattuck cinema so much, sometimes it's just nice to watch a movie & cry in the dark"},{"undefined":"LatLng(37.87255, -122.25689)","lat":37.87255,"long":-122.25689,"message":"I was in my science breadth lab one day and I was struggling so much to barely make it past the first two pages meanwhile it seemed that everyone in my group was just zooming past to the middle of the lab and were so difficult to even get help from. I felt so stupid, desperate, frustrated. Maybe if I hadn't come to Cal from a really shitty school in inner city LA. Maybe if I wasn't so poor I could have an easier time learning.  It was the first time in Cal I was actually on the verge of a mental breakdown over poor performance.  Started tearing up in an empty bench by Evans overlooking the bay. It was almost refreshing as well, in a way. "},{"undefined":"LatLng(37.87018, -122.25972)","lat":37.87018,"long":-122.25972,"message":"A friend and I went to an undocumented student healing circle after September 5th. We both cried in each other's arms. "},{"undefined":"LatLng(37.87243, -122.25843)","lat":37.87243,"long":-122.25843,"message":"I remember crying in VLSB 2050. I had a class in which a law professor was being extremely unsensitive about topics concerning sexual harassment. He did not alow students to leave the classroom on their own accord, and if they did so he would call them out and humiliate them in front of the class. I am a survivor and I could not bear to listen to the lecture since it was very disturbing and provoking. I also felt like I could not leave without being questioned so I sat and cried in an amalgam of horror, sadness, and anger. "},{"undefined":"LatLng(37.86611, -122.2559)","lat":37.86611,"long":-122.2559,"message":"Homesickness and fear of the future"},{"undefined":"LatLng(37.86784, -122.25122)","lat":37.86784,"long":-122.25122,"message":"Just go a 5/30 on a project I worked over 40 hours for. "},{"undefined":"LatLng(37.87197, -122.25779)","lat":37.87197,"long":-122.25779,"message":"Campanile: really missed home and all my friends from high school, felt so lonely and broken. Walked over here at maybe 11:30pm and cried. Something about big structures that let's me feel like I have the permission to be small, to crumble."},{"undefined":"LatLng(37.87148, -122.26466)","lat":37.87148,"long":-122.26466,"message":"Spring 2017 semester I had just started seeing a psychiatrist and was trying out different dosages of antidepressants. The one I was trying was making my memory really bad, and one day I was going to leave a class early to go make up a quiz. I completely forgot and with 5 minutes left for me to get there I was sprinting around LeConte trying to find the room while emailing my GSI. He ended up just leaving before i found the room and I sobbed really hard on one of the bridges connecting the buildings. I didn't have DSP at the time and I had already asked him for a few extensions so i never tried to make up that quiz and I stopped going to that discussion after."},{"undefined":"LatLng(37.86611, -122.25483)","lat":37.86611,"long":-122.25483,"message":"It was a Friday night and I was feeling lonely. I told myself I needed to go eat and after that I would probably feel better. As I descended the steps from my building, I saw a guy I had studied with multiple times in my math class. I waved and said hi, and he looked at me for a solid 10 seconds with his girlfriend laughing in the background and then looked away, and didn't even reply. I was already alone, and now I just felt more invisible. I went to the bathroom in the Academic Center and started sobbing. I threw water on my face so I wouldn't be in there for too long. "},{"undefined":"LatLng(37.8681, -122.255)","lat":37.8681,"long":-122.255,"message":"I got an email that I was denied in-state tuition for the semester, despite meeting all of the requirements and living in California for over a year. I wasn't sure how to tell my parents that we would pay twice what we originally thought, so I just cried."},{"undefined":"LatLng(37.87223, -122.25584)","lat":37.87223,"long":-122.25584,"message":"I learned that my wonderful, handsome, incredibly brave, honorable boyfriend would never be coming home from deployment."},{"undefined":"LatLng(37.87323, -122.25301)","lat":37.87323,"long":-122.25301,"message":"I'd been hoping he'd kiss me for a long time, but when he finally did I realized all at once that there was no way I was genuinely in love with him. I just missed the one I let get away. I cried because of how incredibly unfair I had been to this gentle, sweet new guy. "},{"undefined":"LatLng(37.868, -122.25545)","lat":37.868,"long":-122.25545,"message":"A combination of boy problems, close friends leaving for college, homesickness, and academic stress caused me to break one day. I'm usually someone who bottles up all their emotions until it gets the best of me. "},{"undefined":"LatLng(37.87288, -122.25715)","lat":37.87288,"long":-122.25715,"message":"After constant feelings of being worthless, incompetent, and simply not being good enough. I felt as if I am never going to be good at anything. I cried inside one of the stalls in the bathroom. "},{"undefined":"LatLng(37.86906, -122.262)","lat":37.86906,"long":-122.262,"message":"I worry about my future and if I'm going to be happy in that image"},{"undefined":"LatLng(37.86981, -122.25512)","lat":37.86981,"long":-122.25512,"message":"Stressed about school. Had never asked for an extension on a paper before and felt so pathetic due to not being able to finish it all on time as a college senior. Broke down for a couple hours in the Music Library."},{"undefined":"LatLng(37.86573, -122.24643)","lat":37.86573,"long":-122.24643,"message":"Kissed a same-sex person for the first time at the Clark Kerr track. Was also my first kiss in the rain. I didn't want to be queer. "},{"undefined":"LatLng(37.86882, -122.25246)","lat":37.86882,"long":-122.25246,"message":"bawled uncontrollably on a couch during a frat party for no apparently reason"},{"undefined":"LatLng(37.86493, -122.24895)","lat":37.86493,"long":-122.24895,"message":"got robbed and woke up with the robber in my dorm room\n"},{"undefined":"LatLng(37.86455, -122.26225)","lat":37.86455,"long":-122.26225,"message":"I'm a first generation student, and I am struggling in school. I told my mother about it, and she said, \"I'm sorry for being so stupid.\" \n\nI am on the cusp of failing all my classes. "},{"undefined":"LatLng(37.87057, -122.25395)","lat":37.87057,"long":-122.25395,"message":"Sad because stressed/overwhelmed with two midterms coming up the next day "},{"undefined":"LatLng(37.87425, -122.25732)","lat":37.87425,"long":-122.25732,"message":"After a stressful class on ancient Indian history when the professor told us we'd have to memorize a list of roughly 200 mostly undefined Sanskrit terms for the midterm, I cried in the first floor bathroom of Hearst Mining. I just felt utterly overwhelmed. "},{"undefined":"LatLng(37.86881, -122.25777)","lat":37.86881,"long":-122.25777,"message":"I was walking up the hill on Bancroft Way in the pouring rain.  I had no umbrella and I was drenched and cold.  This was after I completely gave up on my finals and my dream major."},{"undefined":"LatLng(37.87336, -122.25483)","lat":37.87336,"long":-122.25483,"message":"Someone I still love a lot told me they had stopped loving me. "},{"undefined":"LatLng(37.87089, -122.25286)","lat":37.87089,"long":-122.25286,"message":"Cried in front of my professor about my mental health issues and how out of control my life felt. I had been skipping class for two weeks. "},{"undefined":"LatLng(37.87001, -122.25797)","lat":37.87001,"long":-122.25797,"message":"Last week after meeting with my GSI I stopped in the stairway and cried. I felt stressed overwhelmed and lonely. My GSI told me that I was doing a great job and that I will be fine. But I didnt feel that way. Taking a moment to cry allowed me to relieve some of my stress and have a moment to truly take in what my GSI had to say. "},{"undefined":"LatLng(37.86777, -122.25161)","lat":37.86777,"long":-122.25161,"message":"Freshman year. Felt lonely and isolated. Someone on my floor made a rape joke that really upset me. I was shocked that even at a prestigious institution, people can be so blatantly ignorant. I cried for about thirty minutes.  I wanted to go home. "},{"undefined":"LatLng(37.86771, -122.252)","lat":37.86771,"long":-122.252,"message":"My boyfriend and I were having troubles in our relationship. He doesn't go to berkeley, and this is the place we said bye to each other last time he game to visit. I missed him. "},{"undefined":"LatLng(37.87172, -122.25818)","lat":37.87172,"long":-122.25818,"message":"I cried here when my brother called me on the phone to tell me he missed me. "},{"undefined":"LatLng(37.86778, -122.25187)","lat":37.86778,"long":-122.25187,"message":"All the failure. All the imposter syndrome. All the sadness. "},{"undefined":"LatLng(37.87258, -122.26753)","lat":37.87258,"long":-122.26753,"message":"I cried—bawled—because not only I had just found out that back home, my family was suddenly homeless from an illegal eviction, but our landlord unlawfully threw away all of our stuff. I was standing in front of my apartment door crying, and asking my Mom 'why? why us?'. I remember seeing my neighbors looking at me with such sad faces. I was devastated to learn that all my belongings back home were gone, and that my family had no place to stay, while I was in the midst of finals season. Knowing that my mom, sibling, and nine year old brother would have to fend for themselves while I was at Berkeley took a huge emotional toll on me, something that I eventually had to seek counseling for.  It was as if my house had burned down, and everything in it was taken with the flames. It was especially hard knowing that this all had happened just twenty minutes away from my Berkeley apartment, because my family home was in Oakland. I took a walk around the block and kept crying for the rest of the day. "},{"undefined":"LatLng(37.8653, -122.24972)","lat":37.8653,"long":-122.24972,"message":"my friend had just been raped and the rapist was on campus. every day i would come home very overwhelmed and would just cry."},{"undefined":"LatLng(37.86933, -122.255)","lat":37.86933,"long":-122.255,"message":"I've cried just being in public due to my chronic anxiety, depression, and borderline personality disorder when I see triggers of my past -regular people, strangers, my assaulters, and former friends. Cal is a small campus and it's okay to cry in public. "},{"undefined":"LatLng(37.87346, -122.25793)","lat":37.87346,"long":-122.25793,"message":"I started crying in front of an advisor that told me that I couldn't study abroad after I had gone through the entire process of signing up and buying my plane ticket ... later to find out he didn't know what he was talking about/lying "},{"undefined":"LatLng(37.86838, -122.26057)","lat":37.86838,"long":-122.26057,"message":"Working at the call center, I talked to a woman who got so mad at me she told me that my major would be worthless entering the job market and that I would never amount to anything significant "},{"undefined":"LatLng(37.86239, -122.26101)","lat":37.86239,"long":-122.26101,"message":"Broke down during the summer because of stress and feeling inadequate compared to my other friends at other schools who seem to get so much more support than Berkeley students are getting. "},{"undefined":"LatLng(37.86998, -122.25802)","lat":37.86998,"long":-122.25802,"message":"Performed a poem about my trauma for the Poetry to the People class.  It was the first time in my life I spoke about an incredible act of violence that happened 7 years ago, and I bore my soul to my small 9 person section. I will always be grateful for my pears and the ta's for holding space and helping me heal"},{"undefined":"LatLng(37.87228, -122.25996)","lat":37.87228,"long":-122.25996,"message":"I cried every day this past summer studying MCAT in the blue cubbies of Moffit 5th floor. "},{"undefined":"LatLng(37.87153, -122.26277)","lat":37.87153,"long":-122.26277,"message":"procrastinated on another paper and had so much anxiety i just sobbed for an hour in moffitt"},{"undefined":"LatLng(37.87377, -122.26367)","lat":37.87377,"long":-122.26367,"message":"grandma passed away and i was basically drunk and crying for a week"},{"undefined":"LatLng(37.87133, -122.25011)","lat":37.87133,"long":-122.25011,"message":"I got a text from a friend who told me that a boy I went to school with passed away while I was sitting in the student section at a football game. I burst into tears and cried while everyone else was cheering for the team and had to sneak out of the stadium past happy drunk teenagers who gave me weird looks.  "},{"undefined":"LatLng(37.86985, -122.25928)","lat":37.86985,"long":-122.25928,"message":"I cried here in the middle of Sprouling for the elections - I felt like I was going to collapse. I wanted to go  home, I wanted to run away despite how hard I worked to get to the place I was in. Running for Senate is a nightmare. But people saw me crying, some looked at me with pity, they saw weakness, but those who knew me looked at me and told me I was powerful and capable. They held my hand - and I later on, I won. "},{"undefined":"LatLng(37.86952, -122.267)","lat":37.86952,"long":-122.267,"message":"I broke down in front of my neighbor in the middle of spring semester my sophomore year. That semester, I was taking 3 technical classes and was heavily involved with my student org and just couldn't keep it in anymore. I'm thankful for him to this day for just lending me his shoulder to cry on and listening to me vent."},{"undefined":"LatLng(37.86961, -122.26661)","lat":37.86961,"long":-122.26661,"message":"I cried on the way home from school because my nanny had called me and told me that her daughter who had just escaped from her gambler-boyfriend told her that she wanted to get back together with him and that she couldn't do anything about it to stop her since they both lived in Asia. She came from a very poor background and last time, the husband hand sold off all their furniture to gamble. She had no one else to talk to since no one was home at that time, and as I spoke with her, I cried and felt guilty for being stressed and sad about my grades when there are people like her who have bigger and more important issues bugging them. "},{"undefined":"LatLng(37.86812, -122.25504)","lat":37.86812,"long":-122.25504,"message":"Cried in the dorms after failing my first midterm ever at Cal and feeling like a failure. Calling home didn't really help either since my mom told me to \"just study harder\" and \"stop getting distracted\" in school."},{"undefined":"LatLng(37.87147, -122.2617)","lat":37.87147,"long":-122.2617,"message":"I cried here after a break up that took me a long time to get over. I had a hard time focusing on school and felt inadequate for not being able to get over the relationship as quickly as I wanted to and felt really disappointed in myself for letting it affect my ambitions. It took me a long time to find motivation again. I still cry sometimes thinking about what a low point it was! "},{"undefined":"LatLng(37.87224, -122.25431)","lat":37.87224,"long":-122.25431,"message":"realized my roommate was more attractive than me"},{"undefined":"LatLng(37.8732, -122.26039)","lat":37.8732,"long":-122.26039,"message":"It was my first semester at Cal, and I was waiting for the Night Shuttle back home at about 2am when I broke down. I was struggling in all my classes, I missed my family 8000 miles away, and I had no real friends 3 months into college. So I sat there in the cold, alone at 2 in the morning, and cried my heart out."},{"undefined":"LatLng(37.87321, -122.26067)","lat":37.87321,"long":-122.26067,"message":"I had pulled an all nighter through Sunday night, and I wasn't about to sleep anytime soon. I had so much work to do (as everyone else does, I guess). I had been at Mainstacks until 2am, then I went home to Clark Kerr Campus and worked until 6am. Around 8am, I went back to Moffitt, and when I looked at how many hours of class I had that day (7), I felt overwhelmed by regret and tears started streaming down my face as the day began."},{"undefined":"LatLng(37.8676, -122.26521)","lat":37.8676,"long":-122.26521,"message":"CW: sexual assault, mental health\n\nmy first semester here, I was struggling and dealing with PTSD and depression from being r*ped multiple times by an abusive partner. I was walking down Bancroft and suddenly felt a panic attack coming on, I started crying and ran to Tang for their emergency drop-in counseling, which was helpful. "},{"undefined":"LatLng(37.87305, -122.26023)","lat":37.87305,"long":-122.26023,"message":"my family and I were miscommunicating about a weekend-long trip I wanted to take to San Francisco. I was frustrated by their fears, and scared about mine. I wanted to take care of them but it made it too hard to take care of myself, and it felt hard to both be a human with a family and a student with scholastic responsibilities (I had a midterm the next day)."},{"undefined":"LatLng(37.8696, -122.2615)","lat":37.8696,"long":-122.2615,"message":"I cried in the SLC listening to a song that hits very close to my heart as I was studying for a midterm."},{"undefined":"LatLng(37.86588, -122.25532)","lat":37.86588,"long":-122.25532,"message":"Cried after thinking how lonely I was and how different the people at Berkeley are compared to what I had at home. "},{"undefined":"LatLng(37.86936, -122.26013)","lat":37.86936,"long":-122.26013,"message":"I had just found out that the Public Health major had been canceled at the time. I was originally a math major and so it took an immense toll on me when I found out what I wanted to do was taken away from me. Three semester in and I decided on a major that UC Berkeley wanted to take away. I had called my boyfriend at the time and he offered no advice or comfort so I hung up and cried and called my mom who was a much better help."},{"undefined":"LatLng(37.87511, -122.25688)","lat":37.87511,"long":-122.25688,"message":"Realizing that my long distance relationship was failing\n"},{"undefined":"LatLng(37.8706, -122.26211)","lat":37.8706,"long":-122.26211,"message":"Finished a midterm that was only a D or so for Bio1B on Halloween. I sat and cried at the stone bench around here while little kids nearby were trick or treating. I had one kind man ask me if I was okay, but I was obviously sobbing. This was the first of many eruptions of feeling inadequate and like an affirmative action waste of time."},{"undefined":"LatLng(37.87305, -122.26024)","lat":37.87305,"long":-122.26024,"message":"I came here after my summer Math1A final, a class my dad forced me to enroll in to \"raise my GPA\" of 1.98 even though I begged him not to because I hadn't even taken algebra and would be better off in humanities. I thought about how weak I was to submit to his will after I tried sticking up for myself and my future at Cal, only to have no choice in fucking myself over for life. Of course I failed the class, and was dismissed, and I'm typing this now from a community college trying to shoot for readmission in a major I chose for myself that I know I can handle. It makes me want to cry now - painful, painful memories of succumbing to the will of a callous parental figure who wanted to use me as a token of prestige."},{"undefined":"LatLng(37.87443, -122.25821)","lat":37.87443,"long":-122.25821,"message":"Here I spoke to an academic counselor who obviously did not care about my situation and could do nothing for me as I burst into tears telling him I'd have to return to an abusive household that couldn't pay eight thousand dollars right away for tuition the next semester. It was the reason my grades suffered so much in the first place, being berated through any mode of communication my family had for me throughout my entire freshman year. And also not having enough financial aid to close the gap I couldn't afford."},{"undefined":"LatLng(37.87429, -122.25421)","lat":37.87429,"long":-122.25421,"message":"I got yet another phone call from my family denigrating me and my self worth because I wasn't able to be in contact with them all day as I had to, you know, study. I sat in my dorm room finally breaking down, and others noticed what bad shape I was in. I quickly noticed a decline in social invites from the people who had been there. I get it. I was a person with problems that nobody wanted to touch. But I felt so utterly alone and unsupported while living here when my blood relations were treating me so badly and I couldn't do anything about it except make them angrier when I stood up for myself. I had no one."},{"undefined":"LatLng(37.87238, -122.25968)","lat":37.87238,"long":-122.25968,"message":"I've cried in Moffitt more times than I'd like to admit. The last time I cried there, it was 3am and I was reading a book for a life changing class that I truly loved at Cal. The passage went on to talk about a mother, and I started thinking of my own. I was reminded of how this very course, this very major that I wanted to pursue would make her unhappy. It would not only make her unhappy--but sad. I thought about how I couldn't pursue my dreams because she sacrificed her own and her entire being for me. "},{"undefined":"LatLng(37.87977, -122.25715)","lat":37.87977,"long":-122.25715,"message":"I was so far behind in all my classes and everything was totally out of control. I had just bombed a midterm and was anxious about it, so I tried coming to lecture but I didn’t understand a single thing. I felt like I wasn’t meant to be here and everyone at home would know I was a fake, and a failure."},{"undefined":"LatLng(37.86293, -122.26414)","lat":37.86293,"long":-122.26414,"message":"i found out my boyfriend is a liar"},{"undefined":"LatLng(37.87526, -122.26117)","lat":37.87526,"long":-122.26117,"message":"editing is hard"},{"undefined":"LatLng(37.86929, -122.26003)","lat":37.86929,"long":-122.26003,"message":"The morning after a rape,  I had nowhere to go. I was a commuting student at the time. I wanted to shower, I left my charger at my abusers on Ellsworth. I was shocked. At the Muliticultural Community Center, an intern saw the desperation in my eyes and happily gave me their charger. I broke down in that space.  I'm haunted by it, but it has open arms. "},{"undefined":"LatLng(37.86564, -122.26893)","lat":37.86564,"long":-122.26893,"message":"My dog died"},{"undefined":"LatLng(37.87211, -122.26061)","lat":37.87211,"long":-122.26061,"message":"I cried in the Hearst concert hall from stress. I didn't feel prepared for my first semester, knew I was severely ill-prepared for Physics 7A. I blamed myself for not studying more, blamed my high school for not having the budget for AP Physics, blamed the fact that growing up poor maybe did affect how I did in college. "},{"undefined":"LatLng(37.86405, -122.26401)","lat":37.86405,"long":-122.26401,"message":"about to bomb an interview in exactly one hour"},{"undefined":"LatLng(37.87279, -122.25477)","lat":37.87279,"long":-122.25477,"message":"After finishing a CS midterm that I was afraid I failed, for a class I was retaking"},{"undefined":"LatLng(37.87438, -122.25487)","lat":37.87438,"long":-122.25487,"message":"Cried in my dorm room a lot during freshmen year because I was homesick and I felt really alone "},{"undefined":"LatLng(37.86708, -122.25661)","lat":37.86708,"long":-122.25661,"message":"Cried when I had learned I got rejected from the same club for the 4th time in a row. "},{"undefined":"LatLng(37.87296, -122.25512)","lat":37.87296,"long":-122.25512,"message":"Had a panic attack during midterm. Mind blanked out, felt nauseous, wanted to cry, felt like space was caving in, wanted to bolt out of room. After midterm, ran out of room hyperventilating and wailed outside as all the students trickled out, smiling from how do-able the MT was. Later, professor tells me \"you look like you came out of a war zone\""},{"undefined":"LatLng(37.87258, -122.2635)","lat":37.87258,"long":-122.2635,"message":"This past week I got in an argument with my partner. I was waiting for him and he showed up with flowers. I cried out of frustration and joy. "},{"undefined":"LatLng(37.86826, -122.25311)","lat":37.86826,"long":-122.25311,"message":"Graduation is approaching and I often get overwhelmed by both the thoughts of what comes next as well as leaving behind people I love."},{"undefined":"LatLng(37.86875, -122.26012)","lat":37.86875,"long":-122.26012,"message":"Had a tough conversation with my mom about my sexuality while I was sitting in the stairwell of Eshleman"},{"undefined":"LatLng(37.86938, -122.25928)","lat":37.86938,"long":-122.25928,"message":"Trump won."},{"undefined":"LatLng(37.86782, -122.25876)","lat":37.86782,"long":-122.25876,"message":"The pressure and stress of being a student here really got to me one evening, and it didn't help that my roommate and her friends were being hostile towards me. I facetimed my mom, and I realized I was missing her more than ever. Completely lost it after the call end and cried alone in my room for like 2 hours after that. This took place in Martinez Commons"},{"undefined":"LatLng(37.86306, -122.2578)","lat":37.86306,"long":-122.2578,"message":"After spending all of spring break back home, my parents dropped me off at my apartment. When they left, I sat all alone in my room where I started crying really hard out of nowhere. Coming back to my apartment reminded me of everything I was dealing with here: feeling so stupid/mediocre/inadequate in Chem 3B and Bio 1A, internal drama with the people I was living with at the time, and just feeling so alone and feeling like I had nobody to go to here. I cried myself to sleep that night. I really wanted to go back home. "},{"undefined":"LatLng(37.87147, -122.26466)","lat":37.87147,"long":-122.26466,"message":"I cried today in the ground floor of Tolman Hall.  I cried in between participant sessions for an experiment I'm running.  I cried because of a GSI from hell.  I broke down by myself, and also in the lab of a couple of classmates.  They were supportive, but I also feel like maybe I overwhelmed them.  And then I cried about that, too."},{"undefined":"LatLng(37.8747, -122.25793)","lat":37.8747,"long":-122.25793,"message":"Walking out from Soda Hall after several unproductive hours of trying to work on a project. Midterm scores were released and I was really disappointed with my performance. My hopes of declaring as a CS major were shattered. It was cold and dark out, I felt academically hopeless, and I walked alone. That was the first and only time I've cried on campus. I ended up starting over as CogSci and it's been great -- failure led to something better."},{"undefined":"LatLng(37.86996, -122.26351)","lat":37.86996,"long":-122.26351,"message":"A Cal Baseball loss. We don’t lose much at home but it hurts to see. "},{"undefined":"LatLng(37.86476, -122.26184)","lat":37.86476,"long":-122.26184,"message":"In my room, homesick and missing my family."},{"undefined":"LatLng(37.86922, -122.26321)","lat":37.86922,"long":-122.26321,"message":"I cried outside of moffit library where everyone was studying because I just couldn’t understand my linguistics homework. I felt like everyone else was getting it and I felt so defeated. "},{"undefined":"LatLng(37.86655, -122.2585)","lat":37.86655,"long":-122.2585,"message":"I was asked by friend if I was okay and I said no, I was honest and felt like I had to open up to someone and let them know how I was feeling. Everyone else around me acted happy, like they had their shit together. I felt alone and was having issues with my roommate, as well as missing my family and thinking how I didn't belong here. "},{"undefined":"LatLng(37.86841, -122.25249)","lat":37.86841,"long":-122.25249,"message":"Coming back to college after my mom had passed away. Seeing the dorm where she had moved me in freshman year just broke me."},{"undefined":"LatLng(37.86967, -122.268)","lat":37.86967,"long":-122.268,"message":"I was PTSD triggered by a song playing at a restaurant that reminded me of one of my child abusers."},{"undefined":"LatLng(37.86903, -122.25505)","lat":37.86903,"long":-122.25505,"message":"Cried in Cafe Strada three times this week. All three times were related to feeling like I didn't understand the material in any of my classes enough to take my midterms and due to the physical issues the insane amount of stress here has given me."},{"undefined":"LatLng(37.86899, -122.26474)","lat":37.86899,"long":-122.26474,"message":"The other day a girl in my lecture hall rubbed her backpack on me and told me I smelled horrible (4 times in total). People around us noticed, but didn't intervene. She told me I was smelly and worthless. She doesn't seem like she is from around here.  I think she's an international student from China with major princess syndrome (One Child policy?) I used to have tons of international friends in community college. Now, it seems like they really look down on people native to here. I don't understand that. Anyway I struggle with self-esteem issues. This really got to me because it was the first time I ever felt another person regard me as human garbage. "},{"undefined":"LatLng(37.87505, -122.26753)","lat":37.87505,"long":-122.26753,"message":"After failing a midterm for a CS class I needed to declare"},{"undefined":"LatLng(37.86896, -122.2562)","lat":37.86896,"long":-122.2562,"message":"I had a final on the last day, last time slot of finals week. All my roommates had finished days before that and decided to invite a bunch of people over to our apartment and have a loud party the night before my last final. I tried to tell them to keep it down so I could study, but they obviously didn't care much. I ended up driving to Bancroft, sitting in my car, and studying with only my laptop light. I cried all night while studying."},{"undefined":"LatLng(37.87213, -122.25882)","lat":37.87213,"long":-122.25882,"message":"Asked a girl to study with me at moffit but she said no.. I even bought her hot cheetos :( "},{"undefined":"LatLng(37.872, -122.25751)","lat":37.872,"long":-122.25751,"message":"During my freshman spring, after my very last final had let out from LeConte at 10 PM on Friday. The semester was technically over so people everywhere were celebrating in groups. I messaged everyone I knew but everyone was busy. My entire first year of college had passed by and I still felt so alone. So I cried while walking through campus and Southside. "},{"undefined":"LatLng(37.86821, -122.25936)","lat":37.86821,"long":-122.25936,"message":"Got a text mid lab that my friend, who I really loved, had died of a heroin overdose. I tried to tell my lab partner but I knew if I spoke I would lose it so I just showed her the text. As soon as I said \"he was my friend\" I started crying in little bursts. I immediately walked out of lab and ended up sobbing in the walgreens with my sunglasses on, and at the bus stop. I had been sober for a long time and had recently started drinking and using again and it was effecting my school performance, my mental health and now my friend was dead. My 5 year relationship was in shambles and its my first semester here at Cal and honestly I hate it. I can't relate to anyone and I feel more alone than I maybe ever have in my life. "},{"undefined":"LatLng(37.86848, -122.26352)","lat":37.86848,"long":-122.26352,"message":"Oh, I was just hella sad and confused. "},{"undefined":"LatLng(37.86976, -122.25269)","lat":37.86976,"long":-122.25269,"message":"It was the end of my first semester of law school, and I didn't feel like I had done anything right or that I belonged at school-- and my grades only affirmed that I didn't belong.  I was speaking with a professor about my performance on an exam, and even though I didn't want to be crying, I just started crying."},{"undefined":"LatLng(37.86591, -122.25487)","lat":37.86591,"long":-122.25487,"message":"Unit 2 courtyard at 3 in the morning. I had just failed my second midterm and I came across my ex-boyfriend on social media, whom I missed so much. I felt so defeated."},{"undefined":"LatLng(37.86962, -122.26061)","lat":37.86962,"long":-122.26061,"message":"I was overwhelmed by academics and extracurriculars as a first semester freshman and ended up panic-crying on the balcony behind the Student Learning Center. God bless my roommate who was there for me."},{"undefined":"LatLng(34.06766, -118.43983)","lat":34.06766,"long":-118.43983,"message":"i got rejected from berkeley :("},{"undefined":"LatLng(37.8719, -122.25981)","lat":37.8719,"long":-122.25981,"message":"While I was in a seminar to prepare for math midterm, Mom texted me my family friend/ grandpa figure died. "},{"undefined":"LatLng(37.87367, -122.2577)","lat":37.87367,"long":-122.2577,"message":"I cried when my supervisor took credit for my work, asked me to write a grant, hired someone else to continue, and started a company. Felt like mad-max blood-bag boy. "},{"undefined":"LatLng(37.86693, -122.25603)","lat":37.86693,"long":-122.25603,"message":"It was the  day before the beginning of my 2nd semester living off campus, right after my flight. I was stuck in a living situation so bad that I literally bought a meal plan so I could avoid spending time in the apartment with my roommate. I couldn't stop thinking about how much I missed home, how much I missed being valued, how much I took quality food for granted. Eventually I was so overcome with emotion that I went to the bathroom, sat down in a stall, and cried."},{"undefined":"LatLng(37.86265, -122.26414)","lat":37.86265,"long":-122.26414,"message":"Got broken up with. Cried in his bed. He walked me home after. I don’t miss him. "},{"undefined":"LatLng(37.87089, -122.26281)","lat":37.87089,"long":-122.26281,"message":"I'm an alumnus, recently graduated, but I've never really talked about this and I'd like to just get it off my chest. \n\nI've had clinical depression for all my adult life, but in sophomore year, my brain broke. I couldn't stop crying. I've probably cried everywhere on campus you can possibly think of. I cried between classes. I cried on my way to classes. I cried (quietly) IN classes. Literally anything would bring me to tears. It was like throwing up – something unpleasant to watch and deeply embarrassing, but completely beyond my control. In a weird way, though, it made me a walking social experiment. And a genuinely shocking number of students – total strangers, mind you! – would come up to me and check on me. When asked what was wrong, I would lie and say \"midterms\" or something to that effect, but the people who noticed seemed genuinely concerned. Even though I couldn't really pull myself together and thank them properly at the time, I remember feeling so grateful for their kindness. \n\nSomehow I managed this way for a whole year and still passed my classes(!), but in the first few weeks of junior year, I had an exceptionally bad day. I remember just bawling my eyes out and screaming on a concrete ledge in front of Moffitt. Someone came out of FSM and talked to me, but I couldn't really respond. I don't know how long I was there, but when I had calmed down, I realized they had left me a big piece of cake in saran wrap. That was the day I decided to get professional psychiatric help."}]}
