{"events":[{"lat":37.866805,"long":-122.257511,"message":"Stress and personal reasons"},{"lat":37.871206,"long":-122.259353,"message":"The last time was from being overwhelmed by school and life in general, the second being rejection from a creative writing class, and the first time being rejection from the first club I ever applied to at Cal at the beginning of my freshman year"},{"lat":37.873211,"long":-122.264308,"message":"CS61B Project 1 final office hours before the project was due had just ended and my project wasn't complete and I still needed help. "},{"lat":37.875146,"long":-122.25755,"message":"existential crisis abt my future"},{"lat":37.867715,"long":-122.255647,"message":"Friend/Relationship Drama, Anxiety attack, stress"},{"lat":37.872684,"long":-122.261005,"message":"Realized I was going to fail my midterm and also had like 100 other stressful things on my mind"},{"lat":37.872743,"long":-122.260608,"message":"Stressed about midterms, general anxiety "},{"lat":37.867448,"long":-122.264243,"message":"During my freshman year, I was getting birth control for the first time and was seeing a physician about it. During my consultation I ended up fainting and had to sit in the waiting room with my prescription alone for like 15 minutes because the doctor had to move on to other patients. I went to the bathroom in Tang and cried for like 10 minutes once I got to leave but couldn't really tell anyone because I so embarrassed on various levels."},{"lat":37.866352,"long":-122.254402,"message":"Boy problems"},{"lat":37.872557,"long":-122.260597,"message":"Everything "},{"lat":37.867002,"long":-122.259901,"message":"Stress"},{"lat":37.869929,"long":-122.257661,"message":"Just got word that my father suddenly passed away"},{"lat":37.876555,"long":-122.26023,"message":"Work from chem 3b, clubs,  sleep deprivation,  math,  and missing roommate"},{"lat":37.87285,"long":-122.257029,"message":"My life is in shambles!"},{"lat":37.875242,"long":-122.260618,"message":"My daily catharsis"},{"lat":37.867417,"long":-122.260065,"message":"Stress"},{"lat":37.869607,"long":-122.258548,"message":"I had just come out of Asian American Studies R2A, which I was taking over summer. The class was the first time I had dealt with so many issues regarding my identity, specifically coming to terms with my non-heterosexualness. One day, discussion was open to reflecting upon our identities. It was the first time I had talked about my sexuality in such a serious manner, and I bawled my eyes out. The last time I had cried was 7 years ago, so one could imagine how overwhelming yet cathartic the experience was. Once class ended, my friend took care of me, and came with me to Sproul Plaza where I continued to cry for half an hour on that patch of grass."},{"lat":37.872213,"long":-122.257347,"message":"Freaking out about indirect criticism at work that made me feel insecure about my skills at my job."},{"lat":37.871312,"long":-122.256781,"message":"Failed my first midterm"},{"lat":37.874297,"long":-122.2666,"message":"i was sad because i was in a fight with a friend"},{"lat":37.874339,"long":-122.266605,"message":"I failed :("},{"lat":37.872371,"long":-122.260769,"message":"laughing too much!!"},{"lat":37.872328,"long":-122.259756,"message":"I have a mental health condition (GAD) and I cry a lot when I experience stressful confusion or deadlines that trigger my anxiety or give me a panic attack. "},{"lat":37.873954,"long":-122.259566,"message":"Because the maps library was closed :( I love maps"},{"lat":37.869006,"long":-122.254786,"message":"General sadness"},{"lat":37.867913,"long":-122.255356,"message":"Orientation was incredibly overwhelming"},{"lat":37.867989,"long":-122.254712,"message":"My boyfriend was leaving for college and that day was the last time I'd see him for months"},{"lat":37.874018,"long":-122.256298,"message":"I was only able to finish half of my midterm and everyone else finished early"},{"lat":37.870699,"long":-122.260611,"message":"The weight of the world and existential despair"},{"lat":37.875263,"long":-122.260583,"message":"I was in the office the day of the Las Vegas shooting, and had woken up to a breaking news story about the shooting. Someone mentioned that there were some shots fired at USC, where my friend attends. I was worried about her safety. Thankfully, it was a false alarm, the reports of shots fired at USC were false."}]}
